{"global": [{"titre": "Marvel's Greatest Creators: Silver Surfer - Rude Awakening (2019) #1", "description": "Reprinting SILVER SURFER (1987) #51 "}, {"titre": "Silver Surfer Epic Collection: Inner Demons (Trade Paperback)", "description": "Collects Silver Surfer (1987) #123-138, #-1 And Annual ’97. A new beginning! The Silver Surfer is back on Earth, but the world he’s returned to is not the same one he left. The Fantastic Four and Avengers have fallen to Onslaught — and with the Surfer cut off from his memories and emotions, can he even grieve for them? Perhaps he can with the aid of the first Earth woman who taught him compassion: blind sculptor Alicia Masters! A brutal battle against the rampaging Hulk leads to an eye-opening encounter with Doctor Strange — but as Alicia and the Surfer begin a journey through time and space, mind and soul, can the Surfer cope with the return of a longforgotten foe and a startling revelation about his home planet, Zenn-La? Or will the demonic Mephisto finally claim his silver soul? Guest-starring Spider-Man, Daredevil and Alicia’s father, the villainous Puppet Master! "}, {"titre": "Marvel Universe: Time and Again (Trade Paperback)", "description": "Collects Amazing Spider-Man Annual (2018) #1, Captain America Annual (2018) #1, Daredevil Annual (2018) #1, Silver Surfer Annual (2018) #1, Spider-Man Annual (2018) #1, X-Men Gold Annual (2018) #2, Journey Into Mystery: The Birth Of Krakoa (2018) #1. Untold tales of your favorite Marvel heroes! Before Spider-Man discovered his black costume was a symbiote, what nighttime adventures did it take him on? On an advance scouting mission during World War II, Captain America and Bucky face one of their longest nights! Discover the first meeting between Daredevil and hero-hating NYPD Detective Misty Knight! Join the Silver Surfer on a fateful hunt for a planet to feed to his master, Galactus! Learn what spider-powered teen Miles Morales was up to during the Skrull Secret Invasion! Witness Kitty Pryde’s first kiss! And join Sgt. Fury and the Howling Commandos as they encounter the living island Krakoa!"}, {"titre": "The Unbeatable Squirrel Girl Vol. 4 (Hardcover)", "description": "Squirrel Girl goes savage! Savage Land, that is! Will Squirrel Girl fight a dinosaur? Probably! Plus, jokes and a super villain causing major problems — it’s the complete package! Then, go from jungle to outer space as Squirrel Girl and co. journey to the Forbidden Pla-nut! When Nancy and Tippy-Toe are transported to an alien world where all is not as it seems, Squirrel Girl must find a way to get to the other side of the universe to save them. This sounds like a job for the Sorcerer Supreme! No, not Doctor Strange — right now it’s - Loki?! Drax the Destroyer and the Silver Surfer come along for the ride as Doreen Green goes cosmic! Plus: Tippy-Toe meets Rocket Raccoon! Collecting UNBEATABLE SQUIRREL GIRL (2015B) #22-31, and material from A YEAR OF MARVELS: THE UNBEATABLE and NOT BRAND ECHH #14."}, {"titre": "Silver Surfer Facsimile Edition (2019) #14", "description": "Reprinting Silver Surfer (1968) #14!"}, {"titre": "Moon Girl and the Marvel Universe (Trade Paperback)", "description": "Collects Moon Girl And Devil Dinosaur #24 and #31, Venom (2016) #153, Monsters Unleashed (2017b) #12, The Moon Girl Marvel Legacy Primer And Material From Extraordinary X-Men Annual #1. Lunella Lafayette makes new friends across the Marvel Universe! The smartest one of all takes it upon herself to solve the Terrigen crisis threatening the X-Men! And when Venom has a Stegron the Dinosaur Man problem, Moon Girl and Devil Dinosaur will lend a hand (or claw)! But when Big Red exits Lunella’s life, she needs a new partner! Who will it be? Ghost Rider? Daredevil? The X-Babies?! Maybe Kid Kaiju would be a better fit — but he needs help understanding his own monster army! Plus, when the vile Swarm has Lunella’s school hooked on cigarettes, it’s up to her and her faithful dino pal to butt them out!"}, {"titre": "Silver Surfer by Slott & Allred Omnibus (Hardcover)", "description": "Anywhere and everywhere — hang on! Dan Slott and Mike Allred take the Sentinel of the Spaceways on his wildest ride yet — with a very special companion! Meet Dawn Greenwood, the Earth girl who’s enabled the Silver Surfer to see the universe with all-new eyes — and push its boundaries like never before! But that way leads to incredible dangers — like the Never Queen, Warrior One and Jumbonox the Giganormous! From perfect planets to wrathful warriors, from the end of reality to an all-new beginning, they’ll travel the length and breadth of space and time — and beyond! But what could ever make Norrin Radd willing to once again serve Galactus? Slott and Allred weave a cosmic-powered story of triumph, tragedy and boundless imagination! This collection includes the 2016 Eisner Award winning story “Never After”! Collecting SILVER SURFER (2014) #1-15, SILVER SURFER (2016) #1-14 and material from ALL-NEW MARVEL NOW! POINT ONE."}, {"titre": "Silver Surfer Annual (2018) #1", "description": "What mysteries await buried deep within the cosmic multitudes of the Marvel annals? Why — it’s an UNTOLD STORY of the dark and tragic past of the SILVER SURFER, brought to you the mighty Marvel way by ETHAN SACKS (writer of OLD MAN HAWKEYE) and ANDRÉ LIMA ARAÚJO (of the THANOS ANNUAL)! Anxious to find a world worthy enough to sate the mighty hunger of GALACTUS, Norrin Radd’s early explorations as the Devourer’s new Herald bear no fruit. Until the Surfer discovers an exotic alien planet teeming with life…and energy enough to finally satisfy his master. But can the Surfer really doom an entire sentient civilization just to save his own?"}, {"titre": "Fantastic Four: Behold...Galactus! (Hardcover)", "description": "Collects Fantastic Four (1961) #48-50, #74-77, #120-123 and #242-244. The Fantastic Four take on Galactus in one cosmically sized collection! First, Stan Lee and Jack Kirby introduce the World-Eater and his enigmatic herald, the Silver Surfer, as they come for Earth in one of the greatest comic book sagas ever told! Next, Stan and Jack bring big G back — but what does he want this time? The answer lies in the Microverse! John Buscema’s powerful pencils illustrate the arrival of new herald Gabriel the Air-Walker, signaling doom for the human race! Then, John Byrne takes over as Terrax leads the Devourer back to Earth — and the entire Marvel Universe pitches in to help the FF save the planet from becoming his next meal! With Kirby, Buscema and Byrne art showcased on enormous pages, Galactus has never looked bigger — or better!"}, {"titre": "Fantastic Four: The World's Greatest Comics Magazine (Trade Paperback)", "description": "Collects Fantastic Four: World’s Greatest Comics Magazine #1-12. Stan Lee and Jack Kirby’s legendary run on FANTASTIC FOUR lasted more than one hundred issues — and ended all too soon! Now, witness the continuing adventures of Marvel’s First Family, told as if Stan and Jack never left the book! Some of comics’ most talented creators join forces in this time-tossed tribute to the original Imaginauts! Featuring Doctor Doom, the Avengers, the X-Men, Thor, the Hulk, Daredevil, Black Panther, the Inhumans, the Sub-Mariner, the Silver Surfer, M.O.D.O.K., Annihilus and more! It’s an action-packed celebration of everything that made Stan and Jack’s FANTASTIC FOUR truly the World’s Greatest Comics Magazine!"}, {"titre": "Fantastic Four Epic Collection: The Coming of Galactus (Trade Paperback)", "description": "Collects Fantastic Four (1961) #33-51 And Annual #3.\n\nStan Lee called it \"the World's Greatest Comic Magazine,\" and he wasn't kidding. If Lee and Jack Kirby set the comics world on fire in 1961 with the debut of the Fantastic Four, in 1965 they burned it down. Letting loose an unmatched burst of rapid-fire creativity, they gave birth to the Frightful Four, the Inhumans, Galactus and the Silver Surfer — and even pulled off the first super-hero wedding! There are also monster menaces galore, including Dragon Man — and out-of-this-world villains, from the shape-shifting Skrulls to the undersea warlord Attuma. But it's not just the panel-bursting action that makes FANTASTIC FOUR great. It's the drama of a family, united to explore all the wonders of the Marvel Universe side by side!"}, {"titre": "True Believers: Fantastic Four - The Coming of Galactus (2018) #1", "description": "Reprinting Fantastic Four (1961) #48! The Silver Surfer's first appearance!"}, {"titre": "The Unbeatable Squirrel Girl Vol. 8: My Best Friend's Squirrel (Trade Paperback)", "description": "Collects Unbeatable Squirrel Girl (2015b) #27-31 And Material From Not Brand Echh #14.\n\nJourney to the Forbidden Pla-nut! When Nancy and Tippy are transported to an alien world where all is not what it seems, Squirrel Girl must find a way to get to the other side of the universe to save them. And fast! Intergalactic transport through the cosmic realm? This sounds like a job for the Sorcerer Supreme! Doctor Strange will be only too happy to…wait, what's that? Doctor Strange is gone, and now Loki is Earth's Sorcerer Supreme? Oh. Well, I'm sure he'll do his best. After all, what could possibly go wrong? Drax the Destroyer and the Silver Surfer come along for the ride as Doreen Green goes cosmic! Plus: New super-powers and the kind of Squirrel Girl tale you'd never get from Brand Echh!"}, {"titre": "Infinity Countdown (2018) #4", "description": "Ultron has long wished to take over all there is and replace it with only Ultron…but now armed with an Infinity Stone, he has never been closer to his goal. With the Guardians falling apart, who can step forward to stop the singularity from overwhelming everything?"}, {"titre": "Silver Surfer Epic Collection: Thanos Quest (Trade Paperback)", "description": "Collects Silver Surfer (1987) #39-50, Annual #3; Thanos Quest #1-2 and material from Marvel Comics Presents (1988) #50. The Mad Titan is on a quest for Death! The Silver Surfer may believe he has killed Thanos, but the terrible truth is that the Mad Titan still lives — and that’s bad news for the Marvel Universe, because Thanos’ great love has sent him on a space-faring search for the Infinity Gems! Meanwhile, the Surfer tackles a deadly life-form and deals with the madness of Dynamo City! But when Thanos returns from his quest, glove on hand and hell-bent for revenge, do the Surfer, Galactus and Drax the Destroyer stand a chance? And whose side will Mephisto be on? Norrin Radd must face his past as events build to a confrontation that sets the stage for the cosmic epic known as INFINITY GAUNTLET!"}, {"titre": "Infinity Countdown (2018) #3", "description": "As the Guardians’ last mission together draws to a close, the war for the Infinity Stones has only just begun! Adam Warlock continues to search for the Soul Stone but encounters an unexpected foe…the SILVER SURFER?! Keep your eyes to the stars as Marvel’s biggest cosmic story continues!"}, {"titre": "True Believers: Rebirth of Thanos (2018) #1", "description": "Reprinting Silver Surfer (1987) #34!"}, {"titre": "True Believers: Infinity Gauntlet (2018) #1", "description": "Reprinting Infinity Gauntlet (1991) #1!"}, {"titre": "Annihilation: The Complete Collection Vol. 1 (Trade Paperback)", "description": "The explosive outer-space epic that revitalized Marvel’s cosmos! Drax the Destroyer gets a new look, a fresh purpose — and a surprising friend. But when Annihilus, lord of the Negative Zone, unleashes his monstrous Annihilation Wave on our universe, the galaxy’s greatest heroes — and some you might call villains — must brace for war! Annihilus’ opening salvo devastates the Nova Corps, and Richard Rider’s life is changed forever! Can he carry the Corps’ powerful Worldmind alone without going mad? Silver Surfer unites with his fellow heralds to protect Galactus, but what dark bargain must he strike? And a personal mission takes Super-Skrull to the Negative Zone —where he faces betrayal! Plus: Quasar takes on Annihilus, and only one will survive! Collecting DRAX THE DESTROYER #1-4, ANNIHILATION PROLOGUE, ANNIHILATION: NOVA #1-4, ANNIHILATION: SILVER SURFER #1-4 and ANNIHILATION: SUPER-SKRULL #1-4."}, {"titre": "The Unbeatable Squirrel Girl (2015) #30", "description": "It’s the climax (IN SPACE!) of our story as Squirrel Girl (IN SPACE!) faces off against an alien armada (IN SPACE; YES, THIS IS ALSO IN SPACE; THE WHOLE STORY IS IN SPACE!). Not just her life hangs in the balance, but also the lives of Tippy, Nancy, Loki, Drax, the Silver Surfer AND an entire planet full of squirrels, so if you believe that stakes can be raised simply by adding more characters into the mix, GOOD NEWS: YOU ARE IN LUCK! Will Squirrel Girl survive? Will the alien grifters be brought to justice? Will we see more of Horse Thor, The Thor Who Is Actually A Horse And Who May Have Been Invented Solely For This Solicit Text But Maybe Not? Only time, and this comic in particular, will tell!"}, {"titre": "Infinity War Aftermath (Hardcover)", "description": "Collecting Warlock and the Infinity Watch #11-17, Silver Surfer/Warlock: Resurrection #1-4, Quasar #41-43; material from Marvel Comics Presents (1988) #112, Marvel Holiday Special #2! The Infinity War is over - now continue the story with Warlock and the Infinity Watch! Can a comatose Adam overcome his identity crisis and put himself back together again? If he does, Silver Surfer has a favor to ask -one that would pit Warlock against Mephisto for the soul of Surfer's love Shalla-Bal! Plus, there's the battle that green ink was invented for: Drax the Destroyer vs. the Incredible Hulk! Meanwhile, Quasar battles for the title of Protector of the Universe - and his very life; Pip the Troll battles a resident of Monster Isle, the deadly Gamora confronts the U.N. - and don't miss a very Thanos Christmas!"}, {"titre": "Infinity Gauntlet Prologue (Hardcover)", "description": "Collecting Silver Surfer (1987) #34-38, #40, #44-50; Thanos Quest #1-2!"}, {"titre": "The Unbeatable Squirrel Girl (2015) #29", "description": "THE FORBIDDEN PLA-NUT PART 3! For the first time in the HISTORY of comics, we present the color-coded fight we’ve all been waiting for: GREEN (Doreen) ON SILVER (Surfer)! And if fighting the Herald of Galactus— a man who literally has the Power Cosmic at his disposal — isn’t enough, Doreen’s got other problems to deal with, including intergalactic scam artists, Drax the Destroyer and LOKI LAUFEYSON. FEEL the thrill of the fight! SEE it happen, via artisanally selected images and words juxtaposed in deliberate sequence! HEAR the words in your head via your inner voice as you read them, which when you think about it is kind of weird! All we have to do is write down words on a piece of paper, and suddenly they’re re-created in your mind exactly as we intended. Minds are crazy, and language is EVEN CRAZIER. Anyway, please enjoy this comic about a girl and her talking squirrel in space."}, {"titre": "Moon Girl and Devil Dinosaur (2015) #26", "description": "The Fantastic Four may be no more, but no one told GALACTUS! The former Devourer of Worlds and his former herald THE SILVER SURFER have returned to Earth once more, but do they come as friends or foes?!"}, {"titre": "The Unbeatable Squirrel Girl (2015) #27", "description": "What happens when we take Squirrel Girl back to her roots? Well, we shoot her into space, OBVIOUSLY. Nancy and Tippy find themselves on an alien world where all is not what it seems. Squirrel Girl needs to find a way to get to the other side of the universe to save ’em, STAT. Intergalactic transport through the cosmic realm? This sounds like a job for the Sorcerer Supreme! I’m sure Doctor Strange will be happy to he – I’m sorry, what’s that? Doctor Strange is gone and now LOKI is Earth’s Sorcerer Supreme? Oh. Well, I’m sure he’ll do his best. After all, what could possibly go wrong? Guess what, in this issue, everything possible goes wrong!"}, {"titre": "Silver Surfer Vol. 5: A Power Greater Than Cosmic (Trade Paperback)", "description": "The Surfer and Dawn are back in space — and back in trouble! At the universe’s slickest space casino, Norrin Radd is going all in — and the stakes have never been this cosmic! When our heroes are accidentally swallowed by Jumbonox the Giganormous, their only hope is a society of sentient macro-microorganisms — who, through no fault of their own, might just be the deadliest disease in the universe! And on the hauntingly beautiful world of Inkandesha, the spacefaring couple might completely lose themselves! But will they finally be torn apart by the vengeful Warrior Zero — or a certain world-devouring former master? Is heartbreak in store for Norrin and Dawn? Theirs is the story of a love that ended before it started, and began after it died. But is it a love that can outlast the universe? Collecting SILVER SURFER (2016) #7-14."}, {"titre": "Silver Surfer (2016) #14", "description": "EVERYWHERE When the Silver Surfer first told Dawn Greenwood he could take her anywhere and everywhere, he forgot - that everywhere includes the place where journeys end. Please join us for one final trip around the universe."}, {"titre": "Incredible Hulk Epic Collection: The Hulk Must Die (Trade Paperback)", "description": "Marvel's green goliath is pulling no punches! After the cancellation of his debut series, the incredible Hulk returns in Tales to Astonish...and he means business! Dr. Robert Bruce Banner's alter ego battles General \"Thunderbolt\" Ross, the Leader and his Humanoids, the Executioner, and more communists than you can shake a tank at. And if that's not enough, round two pits the Hulk against Hercules, introduces classic villain the Abomination, dives into the intrigue of the Secret Empire, and goes cosmic with the Silver Surfer and the High Evolutionary! Featuring stories by Stan Lee and art by a who's who of Marvel greats - Steve Ditko, Jack Kirby, Gil Kane, Bill Everett and John Buscema - these are the tales that made the Incredible Hulk a global icon! Collects Tales to Astonish (1959) #60-96, material from Not Brand Echh (1967) #3."}, {"titre": "The Mighty Thor Omnibus Vol. 3 (Hardcover)", "description": "Stan Lee! Jack Kirby! John Buscema! Their Thor sagas were so big, so epic, so utterly cosmic in scope, we may need to ask the Surgeon General to slap a warning on this oversized Omnibus collection! It begins with the malignant Mangog, a beast from the darkest depths of Asgard...a beast of the apocalypse Ragnarok! Then, Thor and Ego the Living Planet battle Galactus! The Lord of the Underworld returns! \"Him\" kidnaps Lady Sif! Galactus' origin is told -and Thor grapples with the Wrecker! Meanwhile, Loki enters the fray, scheming his way to Asgard's throne and putting the entire realm at risk. And don't forget the Silver Surfer! With painstaking art restoration and every original letters page included, this Omnibus is a must-have for every Marvel fan! COLLECTING: THOR (1966) #153-194."}, {"titre": "Daredevil Epic Collection: Heart of Darkness (Trade Paperback)", "description": "All hell breaks loose! Things really get heated as Daredevil is caught between the diabolical Mephisto and his monstrous son Blackheart! The Man Without Fear and his friends will be forced to face their demons like never before! Are they fated to burn for eternity in the fiery underworld, or can they find their way back home? And what role will the Silver Surfer play? As Atlantis Attacks, Daredevil must face - Spider-Man! And DD, the Surfer, Punisher and the Hulk will be stalked by Lifeform! Meanwhile, Acts of Vengeance puts Daredevil well out of his weight class in a battle against Ultron! Good thing Karnak and Gorgon of the Inhumans are around to lend a hand (and cloven hoof)! Collecting DAREDEVIL (1964) #271-282 and ANNUAL #5-6, and material from PUNISHER ANNUAL #3, INCREDIBLE HULK ANNUAL #16 and SILVER SURFER ANNUAL #3."}, {"titre": "Defenders Epic Collection: Ashes, Ashes… (Trade Paperback)", "description": "The Defenders face threats Satanic, Seussian and everything in between! Marvel's greatest non-team will take you on adventures made with their own special brand of action and interpersonal drama, topped by a heaping helping of the absurd! In this Epic Collection, the Defenders battle the cosmic Over-Mind, the alternate-Earth Squadron Supreme, the fan-favorite Elf with a Gun, the Avengers and even themselves! Patsy Walker's relationship with Daimon Hellstrom - the Son of Satan - will flower, while classic Defenders - Hulk, Namor, and the Silver Surfer - will return! Out of it all, the New Defenders -featuring Iceman, Angel, Beast, and Moondragon - will rise, and nothing will be the same. Same as it ever was! Collects Defenders (1972) #110-125, Avengers Annual (1967) #11."}, {"titre": "Silver Surfer (2016) #13", "description": "Once upon a time, a strange device scanned the Silver Surfer and found him the one being who was his \"most important person in the universe,\" Dawn Greenwood. And, it turned out, he was her \"most important person in the universe\" too. This is the story of a love that ended before it started, and began after it ended. But is it a love that can outlast the universe? Because the universe is about to go away. For real."}, {"titre": "Doctor Strange, Sorcerer Supreme Omnibus Vol. 1 (Hardcover)", "description": "Doctor Strange stars in his most spellbinding series! The world believes Strange dead, and Dormammu has stolen control of the Sorcerer Supreme's body. But when Clea comes to Stephen's aid, the two must make a binding commitment! There'll be Faustian gambits to deal with, Strange will be given the tabloid treatment, and he'll face unfamiliar foes like Hobgoblin and the Enchantress! But during the Dark Wars against Dormammu, will Baron Mordo become Earth's Sorcerer Supreme? Then, Strange stares down the supernatural as vampires like Baron Blood make their comeback! The Infinity Gauntlet will pit Strange against old friend Silver Surfer, but who else could lend a hand against the Fear Lords? It's Daredevil, Man Without Fear! COLLECTING: DOCTOR STRANGE, SORCERER SUPREME #1-40, GHOST RIDER (1990) #12."}, {"titre": "Silver Surfer (2016) #12", "description": "There is only one secret in the Universe worth knowing. And when it is revealed, the story of the Silver Surfer and Dawn Greenwood will never be the same. A trip to a familiar planet, the return of old friends and a fight Norrin Radd cannot afford to lose. After what happened last issue, you need to read this story. Trust us."}, {"titre": "SILVER SURFER EPIC COLLECTION: THE INFINITY GAUNTLET TPB (Trade Paperback)", "description": "To Infinity and beyond! Follow the sentinel of the spaceways into a Marvel Universe-spanning cosmic extravaganza against the Mad Titan Thanos - who wears the Infinity Gauntlet! Drax battles Firelord, the Surfer fights the Rhino and Thanos forces Norrin to get introspective! But is this dimension big enough for the ultimate duel between the Silver Surfer and the Mad Titan? When the dust settles on Earth, the Surfer heads back into space, only to face Midnight, the Inhumans and the Collector! But how will that lead to him coming face to face with...Captain Mar-Vell? Plus, the Surfer faces the undead, joins Mr. Fantastic on an emergency mission, and takes on the Guardians of the Galaxy in the 26th century! And Nova goes solo! Collecting Silver Surfer (1987) #51-66, Annual #4; material from Marvel Comics Presents (1988) #69, 93-97."}, {"titre": "Silver Surfer (2016) #11", "description": "He used to be Warrior One, the ultimate soldier. Then he lost a fight with the Silver Surfer and was stripped of his rank. Now he’s upped his game and is back for vengeance as WARRIOR ZERO! It’s a cosmic throwdown for the ages! And when it’s over…Silver Surfer and Dawn’s lives will never be the same again. Not an idle boast or bombastic hyperbole. This issue profoundly changes this entire series. DON’T MISS THIS ONE."}, {"titre": "GUARDIANS OF THE GALAXY CLASSIC: IN THE YEAR 3000 VOL. 3 TPB (Trade Paperback)", "description": "Concluding the adventures of the original Guardians of the Galaxy, heroes of the 31st century! When Charlie-27 is imprisoned for a crime he did not commit, Major Victory and the team stage a breakout with the aid of Cuchulain, the Irish Wolfhound - but Drax the Destroyer stands in the warrior's way! But if Charlie is innocent, who's guilty? Enter Ripjak: the interplanetary serial killer with a surprising connection to Spider-Man! Where will the Guardians stand in a tussle between Ripjak, Bubonicus and the High Evolutionary? Rancor strikes, Starhawk tackles the Silver Surfer, Yellowjacket heads for home, and the Guardians seize a chance to end the millennium-old War of the Worlds! Collects Guardians Of The Galaxy (1990) #51-62, material from Guardians Of The Galaxy Annual #4."}, {"titre": "Silver Surfer (2016) #10", "description": "”UNHERALDED” There’s only one reason the Silver Surfer would ever serve Galactus again...if the Universe itself hung in the balance! Will this be the final straw that breaks up Marvel’s most cosmic couple?"}, {"titre": "Silver Surfer (2016) #9", "description": "\"Worlds Apart\" STARTS NOW! The world of Inkandesha is hauntingly beautiful, filled with cities of solid light and populated by living holographic people. But there's one tiny thing the people of this world probably should've told the Silver Surfer and Dawn before they decided to pop in for a visit...they might have a problem getting their physical bodies back."}, {"titre": "Silver Surfer (2016) #8", "description": "\"Microcosmic\" Accidentally swallowed by Jumbonox the Giganormous, the Surfer and Dawn are rescued by a society of sentient macro-microorganisms...who, by no fault of their own, might just be the deadliest disease in the universe."}, {"titre": "Silver Surfer (2016) #7", "description": "“The Infinite All-In” Norrin and Dawn are back out in space and back in trouble! While at the universe’s slickest space casino, the Silver Surfer may be gambling away more than he thinks. The stakes have never been this cosmic!"}, {"titre": "Silver Surfer (2016) #6", "description": "Oversized anniversary issue! After Norrin Radd’s massive status quo change in the 50th Anniversary issue (no spoilers!), it’s now Dawn Greenwood’s turn. With one simple act of kindness, the Surfer may have forever changed her world. What’s going on? Why is San Francisco overrun by monsters? And what wall-crawling, web-spinning guest star is swinging by to help out? (Okay, we’ll tell you that one! It’s Peter Parker, THE AMAZING SPIDER-MAN!) All this and tons of cosmic weirdness, surprise super heroes and special stories as we celebrate the 200th SILVER SURFER issue!"}, {"titre": "Silver Surfer (2016) #5", "description": "SILVER SURFER #200! Oversized anniversary issue! After Norin Radd’s massive status quo change in the 50th Anniversary issue (no spoilers!), it’s now Dawn Greenwood’s turn. With one simple act of kindness, the Surfer may have forever changed her world. What’s going on? Why is San Francisco overrun by monsters? And what wall-crawling, web-spinning guest-star is swinging by to help out? (Okay, we’ll tell you that one! It’s Peter Parker, THE AMAZING SPIDER-MAN!) All this and tons of cosmic weirdness, surprise super heroes, and special stories as we celebrate the 200th Silver Surfer issue!"}, {"titre": "Silver Surfer (2016) #4", "description": "Massive fallout from the events of Silver Surfer’s 50th Anniversary issue. There is a price to pay for what Norrin Radd has done. Some actions can never be taken back...or forgiven. Will any of Earth’s heroes stand by the Silver Surfer’s side in this, his greatest moment of need? A mythic tale in the Mighty Marvel Manner! Guest starring The Avengers, The Thing and major characters from around the Marvel Universe."}, {"titre": "Daredevil (2011) #30", "description": "<ul><li>When soars the Silver Surfer!</li><li>What weird menace unites Daredevil with the Cosmic Rider of the Spaceways?</li></ul>"}, {"titre": "Silver Surfer by Stan Lee & Moebius (2013) #1", "description": "<ul><li>Galactus has converted humanity into his followers, and he&rsquo;s leading them to their doom!</li><li>His only challenger is the hero he himself trapped on Earth: the Silver Surfer!</li><li>It&rsquo;s a war for Earth&rsquo;s worship, but how much will be left when it&rsquo;s over?</li><li>Collecting SILVER SURFER: PARABLE #1-2.</li></ul>"}, {"titre": "Defenders (2011) #8", "description": "Into Z'Gambo to face the menace of John Aman, Prince of Orphans! What secret is Aman hiding worth killing so many for so long? And just how is the Black Cat going to steal it?"}, {"titre": "New Mutants (2009) #44", "description": "Guest-starring the Defenders! Dr. Strange's team protects humanity from the impossible...so what does this uber powerful group want with the New Mutants?"}, {"titre": "The Mighty Thor Annual (2012) #1", "description": "Thor caught in a war of eons between two cosmic entities! Can even Galactus and the Silver Surfer tip the balance? An eternal game for the fate of the universe enters its final match, with Oblivion himself ready to take the prize!"}, {"titre": "Defenders (2011) #5", "description": "Who are the Nereid and what secret are they keeping? And what place does Captain Nemo have in Namor's past?"}, {"titre": "Defenders (2011) #3", "description": "Inside Wundagore Mountain, the Concordance Engine comes to life, and the Defenders' mission snaps into crystal-clear focus. What does this miraculous machine do? What happens if it doesn't do its job? And how many more are there around the world?"}, {"titre": "Defenders: Strange Heroes (2011) #1", "description": "The OFFICIAL HANDBOOK OF THE MARVEL UNIVERSE helps usher in the Defenders' return to prominence with new profiles featuring Marvel's premier non-team! Past members (Manslaughter, Andromeda, Interloper, Cloud), foes (the Asgardian Lorelei, Mad-Dog/Baxter, Jake Fury, Sea Urchin), the unusual (Tapping Tommy, Sunshine Gross, Foolkiller/Salinger), objects of great power (Star of Capistan, Rose of Purity, Evil Eye), and one of the strangest moments in Marvel history and the man responsible for it: Defenders for a Day and Dollar Bill! Plus: updates on the team itself and its current members (Dr. Strange, Iron Fist, Namor, Red She-Hulk, Silver Surfer). Featuring new art for dozens of profiles by Gus Vazquez!"}, {"titre": "Defenders (2011) #1", "description": "Springing out of Fear Itself! Everyone's favorite Marvel characters band together to solve a mysterious conspiracy deep at the heart of the Marvel Universe! They are the last line of defense against the forces of the unknown! They are The Defenders!"}, {"titre": "Point One (2011) #1", "description": "Here are seven all-new stories that set the stage for everything coming your way in 2012 from the biggest names in the comics industry."}, {"titre": "Point One (2011) #1 (Bradshaw Inked Variant)", "description": "Here are SEVEN all -new stories that set the stage for everything coming your way in 2012 from the biggest names in the comics industry.You CANNOT miss this. Catch a tease of the biggest change to the Marvel Universe in over 35 years !"}, {"titre": "Point One (2011) #1 (Bradshaw Variant)", "description": "Here are SEVEN all -new stories that set the stage for everything coming your way in 2012 from the biggest names in the comics industry.You CANNOT miss this. Catch a tease of the biggest change to the Marvel Universe in over 35 years !"}, {"titre": "Spider-Man Marvel Adventures (2010) #19", "description": "WHAT HAPPENS WHEN SPIDER-MAN WIELDS THE POWER COSMIC?! The Silver Surfer is POWERLESS in New York, and it's up to Spidey to set things right! Will Spider-Man be able to find the Sentinel of the Spaceways in time?! J.M. DeMatteis (AMAZING SPIDER-MAN) and Clayton Henry (SPIDER-GIRL) stop by this month to bring you THE POWER COSMIC! Then, the hunt is on as Spider-Man goes toe-to-toe with KRAVEN in the heart of New York's concrete jungle!"}, {"titre": "The Mighty Thor (2011) #6 (Architect Variant)", "description": "The finale of THE GALACTUS SEED! Odin and Galactus are ready to fight one another to the death and only Thor and the Silver Surfer stand between them... and us! And in Fallen Asgard, Volstagg leads an unlikely army in aide of man and Asgardian alike...but what if only Loki holds the key to saving the day?"}, {"titre": "Fear Itself: The Deep (2011) #4", "description": "FEAR ITSELF TIE-IN\nNamor, Doctor Strange, She-Hulk & The Silver Surfer giant have battled barbarian hordes, giant monsters, and demonically- possessed sea creatures. They've faced Tyrak the Terrible, Aradnea the Sorceress, and the hideously-mutated Tiger Shark. But their greatest threat still awaits-the Worthy who has already beaten the Sub-Mariner and single-handedly ravaged New Atlantis. Would-be conqueror Attuma has become Nerkkod, Breaker of Oceans, and he intends to drown the entire world in a wave of fear! Even if Namor's courage and resolve return to him, he's no match for the fury of the Serpent's chosen!"}, {"titre": "The Mighty Thor (2011) #6", "description": "The finale of THE GALACTUS SEED! Odin and Galactus are ready to fight one another to the death and only Thor and the Silver Surfer stand between them... and us! And in Fallen Asgard, Volstagg leads an unlikely army in aide of man and Asgardian alike...but what if only Loki holds the key to saving the day?"}, {"titre": "The Mighty Thor (2011) #6 (Architect Sketch Variant)", "description": "The finale of THE GALACTUS SEED! Odin and Galactus are ready to fight one another to the death and only Thor and the Silver Surfer stand between them... and us! And in Fallen Asgard, Volstagg leads an unlikely army in aide of man and Asgardian alike...but what if only Loki holds the key to saving the day?"}, {"titre": "The Mighty Thor (2011) #5", "description": "Thor and the Surfer battle on the surface of Mars, hundreds of millions of kilometers away from the ultimate Asgardian-Galactus WAR! And meanwhile on Earth, Volstagg is left alone to defend Asgard from hostile invaders... well, all alone, save for Loki who comes bearing the magical gifts of the Weird Sisters that only he can see. Will they REALLY  be the key to saving Thor's life? Who will survive... THE RISE OF THE COSMIC DESTROYER?"}, {"titre": "Fear Itself: The Deep (2011) #3", "description": "FEAR ITSELF TIE-IN! In the midst of FEAR ITSELF, anything goes! Just as the unlikely team of Namor, Dr. Strange, the Silver Surfer, the Savage She-Hulk, and Loa band together, they're torn apart by a nightmare from the depths. And now each of these heroes must face an almost unstoppable enemy--and crushing fear--alone!"}, {"titre": "Fear Itself: The Deep (2011) #2", "description": "FEAR ITSELF TIE-IN! The Sub-Mariner's kingdom has fallen! Namor and his allies--Dr. Strange, the Silver Surfer, the Savage She-Hulk, and Loa--must invade New Atlantis and wrest control from the sinister forces that have claimed the city. With Namor still shaken by the crushing defeat he has suffered, our heroes may be no match for the frightening opposition they're set to encounter as the Worthy's lieutenants summon dark forces that spill into the oceans...and one team member may be forever changed as fear takes over."}, {"titre": "The Mighty Thor (2011) #4", "description": "ASGARD RISES AGAINST GALACTUS! The World Eater has come for something buried deep within the heart of Fallen Asgard. As Odin leads an assault wave of gods against Galactus, a wounded Thor must contend with the Silver Surfer once more! All of which leaves Volstagg and Kid Loki in charge of the Shining City for an afternoon. What could possibly go wrong?"}, {"titre": "The Mighty Thor (2011) #2 (2nd Printing Variant)", "description": "The Silver Surfer has arrived on Earth with a message: Galactus is coming! Thor is the only one powerful enough to?stand against the might of the World Eater but he has been weakened from his journey to the World Tree! Loki and Sif join forces to protect Asgard on Earth, but can they manage without Thor? The secrets of the GALACTUS SEED can not stay buried for long..."}, {"titre": "Defenders: From the Marvel Vault (2011) #1", "description": "The original team of Doctor Strange, The Hulk, Silver Surfer and Namor are together again, in a tale long thought lost! What manner of illusion has been cast that has changed the very lives of the Defenders? Can they break free?"}, {"titre": "Thor: Blood & Thunder (Trade Paperback)", "description": "When the God of Thunder goes berserk, the most powerful heroes in the universe may not be able to stop him! See Thor tear through the ranks of Beta Ray Bill, the Silver Surfer, Adam Warlock, Dr. Strange, Drax the Destroyer and Thanos! And when the mad Thor gets his hands on the Infinity Gem of Power, even Odin may be powerless to stop him! Collecting THOR (1966) #468-471, SILVER SURFER (1987) #86-88, WARLOCK CHRONICLES #6-8 and WARLOCK AND THE INFINITY WATCH #23- 25."}, {"titre": "The Mighty Thor (2011) #3", "description": "The fate of the world lies in the hands of the Asgardians, for Galactus is coming...and he hungers! Thor and the Silver Surfer must determine what to do with the Galactus Seed, the artifact with the potential to end the entire universe. And what deal is being struck between Odin and Galactus himself, behind closed doors?"}, {"titre": "Impossible Man (Trade Paperback)", "description": "He's green, he shape-shifts, he flies - he does the impossible! See the aptly named Impossible Man wreak havoc across the Marvel Universe, from Latveria to the S.H.I.E.L.D. Helicarrier to the Savage Land! And wait till you meet the Impossible Woman - and their kids! Guest-starring EVERYONE - from the Fantastic Four to Spider-Woman to Thor to the X-Men! Collecting FANTASTIC FOUR (1961) #11 and #176, MARVEL TWO-IN-ONE #60 and #86, SPIDER-WOMAN (1978) #45, X-MEN ANNUAL #7, NEW MUTANTS ANNUAL #3, SILVER SURFER (1987) #33, IMPOSSIBLE MAN SUMMER VACATION SPECTACULAR #1-2, MARVEL COMICS PRESENTS (1988) #91, and X-FORCE & CABLE ANNUAL '95"}, {"titre": "The Mighty Thor (2011) #3 (I Am Captain America)", "description": "The fate of the world lies in the hands of the Asgardians, for Galactus is coming...and he hungers! Thor and the Silver Surfer must determine what to do with the Galactus Seed, the artifact with the potential to end the entire universe. And what deal is being struck between Odin and Galactus himself, behind closed doors?"}, {"titre": "Silver Surfer (2010) #5", "description": "Herald vs. Herald for the fate of all life in the universe! The High Evolutionary has stolen the power to replace Galactus, the lives of billions hang in the balance, and the one threatening to doom them all...is the Silver Surfer!?"}, {"titre": "Annihilators (2010) #4", "description": "The Annihilators finally reach the epic conclusion of their battle with the Dire Wraiths. Will the Annihilators manage to prove that they have what it takes to be the protectors of the universe, or will they fall to the Dire Wraiths' magic?"}, {"titre": "Annihilators (2010) #4 (VARIANT)", "description": "TWO AWESOME STORIES IN ONE COSMIC BOOK! This is it: the galaxy's most powerful squad and most beloved duo face their fiery finales! First, the Annihilators must prove they are the ace team of universal protectors that Star-Lord dreamed they could be...or perish in the attempt! Meanwhile, Rocket Raccoon and Groot face the horrible, reality-twisting menace - who has a key connection to Rocket's secret past - that lurks in the heart of the Half-World Asylum! Want to show the House of Ideas that you want more Marvel Cosmic? Spread the word and buy this issue!"}, {"titre": "Fear Itself: The Deep (2011) #1", "description": "FEAR ITSELF TIE-IN! Namor is targeted for death by one of the hammer-wielding Worthy and this is a battle no one hero can survive! With the X-Men under siege from a shocking foe and all hope seemingly lost, the Sub Mariner finds an ally in his old friend Dr. Strange. Can Strange recruit a team powerful enough to keep the seas safe from the spread of fear and chaos gripping the world? If he can't, there may just not be any hope for the rest of the Marvel Universe!"}, {"titre": "Marvel Masterworks: The Mighty Thor (Hardcover)", "description": "All hail Asgard! All hail the titanic tenth Thor MASTERWORKS! Stan \"The Man\" Lee and Big John Buscema are back, bringing you a set of comic-book masterpieces as only mighty Marvel could present. So join Thor, Odin, Balder, the lovely lady Sif and the Warriors Three as they confront colossal cosmic threats that only the gods of Asgard can counter. It all starts off with the amazing Infinity epic! An unimaginable destructive force is marching across the universe - one so powerful that before he can face it, the Mighty Thor must travel across Hela's realm of the dead and face off in battle against no less than all-father Odin himself before it can be stopped! It's a father vs. son battle to shake the heavens! And of course, there's treachery a-plenty, courtesy of the mischievous Loki. Teamed with Karnilla, the Norn Queen, Loki won't stop until the throne of Asgard is his, and hell descends upon Earth in the form of Durok the Demolisher. He's an enemy so powerful that Thor must team up with the Silver Surfer to match his might. Then, it all comes to a head when Thor must run a gauntlet of towering Storm Giants before Loki weds the Lady Sif! We'll meet you at the altar! Collecting THOR #184-194."}, {"titre": "Chaos War One-Shots (Trade Paperback)", "description": "Cutting a path of destruction across the Marvel Universe, Chaos King has obliterated the underworld - freeing the dead to walk the Earth! Now, there may be no one left to stop him - no one, that is, except a handful of deceased X-Men and the original members of Alpha Flight, back from the great beyond! Plus: Chaos King has decimated the pantheons of Earth - but the new God Squad has a last, desperate plan to halt Mikaboshi's march toward oblivion! Join the Hellstorm, Silver Surfer, Sersi, Venus and more of Marvel's most daring deities on an epic adventure that's sure to rock the heavens! And finally, what method or madness lies within the mind of the Chaos King? Witness the first strikes of CHAOS WAR here! Collecting CHAOS WAR: X-MEN #1-2, CHAOS WAR: ALPHA FLIGHT, CHAOS WAR: GODSQUAD, CHAOS WAR: CHAOS KING and material from X-MEN: CURSE OF THE MUTANTS SPOTLIGHT."}, {"titre": "Silver Surfer (2010) #4", "description": "High Evolutionary's grand design is rewriting the world and Surfer can't save us on his own. The Future Foundation joins the fight as our penultimate issue builds to a cosmic climax that will be the Silver Surfer's greatest sacrifice ever!"}, {"titre": "Deadpool Team-Up Vol. 3 (Hardcover)", "description": "Everyone's favorite Merc with a Mouth continues hacking and wisecracking his way across the Marvel Universe in this latest volume of riotous, ridiculous and outright reprehensible team-ups! In Round 1, it's clobberin' time as Deapoolmania runs wild on the Thing! In Round 2, Indiana Deadpool runs afoul of Thor amid Asgard's ruins and learns some treasures are best left undisturbed - particularly the ones containing evil, enormously powerful spirits imprisoned by Odin thousands of years hence. In Round 3, Deadpool and Iron Fist grudgingly team up to stop an ancient and villainous warlord - but Deadpool have to take down Iron Fist, as well, to secure his payday? In Round 4, gaze in horror upon the fiendish experiments inflicted upon Deadpool and Bessie the Vampire Cow by the malevolent Dr. Kilgore in the name of mad science, and bear witness to their terrible revenge! In Round 5, the voices in Deadpool's head hire him to do the dirtiest job of his career, but the mission is endangered when he's trapped in an elevator with the Watcher! In Round 6, Deadpool realizes there's no government bailout for super-powered mercenaries and is forced to do the unthinkable: look for a job! Luckily, Galactus has a position open in the Herald department. And for the knockout punch: Wolverine, Deadpool and a giant robot! Collecting DEADPOOL TEAM-UP #888-883 and WOLVERINE/DEADPOOL: THE DECOY (MDCU)."}, {"titre": "Annihilators (2010) #3 (DJURDJEVIC VARIANT)", "description": "The most powerful super team ever-that's right, we said it-faces the threat of the infamous Dire Wraiths! But can a squad that includes Silver Surfer, Gladiator and Beta-Ray Bill defeat this diabolical race and the dark magic they are unleashing?  Meanwhile, Rocket Raccoon and Groot zoom deeper into their adventure as Rocket's secret and slightly crazy origin is revealed!"}, {"titre": "Annihilators (2010) #3", "description": "As the battle rages on between the Annihilators and the Dire Wraiths, it seems as if the Dire Wraiths may be too strong for even the Annihilators to handle. What will the conclusion to this epic battle mean for the rest of the Marvel Universe?"}, {"titre": "The Mighty Thor (2011) #1 (Travis Variant)", "description": "It's a shining, golden, new age for the Thunder God and Matt Fraction and Olivier Coipel are back to lead the charge! Thor and Sif dive deep into the heart of the fractured World Tree to reclaim an artifact from beyond time and space, an artifact that attracts the attention of the Silver Surfer. And when a herald such as he arrives on Earth, the arrival of his master is certain to follow. Prepare for the return of the World Eater...prepare for the return of Galactus! Fans can't miss an all new behind the scenes look at the highly anticipated major motion picture with a sneak peek at some of the art!"}, {"titre": "The Mighty Thor (2011) #1 (Blank Variant)", "description": "It's a shining, golden, new age for the Thunder God and Matt Fraction and Olivier Coipel are back to lead the charge! Thor and Sif dive deep into the heart of the fractured World Tree to reclaim an artifact from beyond time and space, an artifact that attracts the attention of the Silver Surfer. And when a herald such as he arrives on Earth, the arrival of his master is certain to follow. Prepare for the return of the World Eater...prepare for the return of Galactus! Fans can't miss an all new behind the scenes look at the highly anticipated major motion picture with a sneak peek at some of the art!"}, {"titre": "Marvel Masterworks: The Fantastic Four Vol. 6 (Trade Paperback)", "description": "Continuing their greatest-hits streak on the \"The World's Greatest Comic Magazine,\" Stan Lee and Jack Kirby weren't content just to introduce the Inhumans, Galactus and the Silver Surfer. No, a three-peat was thinking far, far smaller than the most amazing team in comics' history imagined. Their followup was a heart-wrenching tale of tragedy and heroism titled \"This Man! This Monster!\" If this story doesn't make you come to love Benjamin J. Grimm, then yer heart must be made of orange rock, fella! Because the greatest Fantastic Four story wasn't enough, Stan and Jack had yet another unmatched milestone waiting in the wings: the debut of the world's first African super hero, the Black Panther, and his kingdom of Wakanda! And that's just the start! In the pages of this MARVEL MASTERWORKS, you'll also encounter the vile Klaw; see the Silver Surfer go toe-to-toe with the Thing; watch the Human Torch face his namesake, the original 1940s Torch; and wonder in shock and awe at how the Fantastic Four can hope to overcome Dr. Doom when he's wrested the Power Cosmic from the Surfer himself! We can't guarantee you won't wear out the pages of this volume reading stories this great again and again! You may want to order two just in case! Collecting FANTASTIC FOUR #51-60 and ANNUAL #4."}, {"titre": "The Mighty Thor (2011) #1 (Thor Hollywood Variant)", "description": "It's a shining, golden, new age for the Thunder God and Matt Fraction and Olivier Coipel are back to lead the charge! Thor and Sif dive deep into the heart of the fractured World Tree to reclaim an artifact from beyond time and space, an artifact that attracts the attention of the Silver Surfer. And when a herald such as he arrives on Earth, the arrival of his master is certain to follow. Prepare for the return of the World Eater...prepare for the return of Galactus! Fans can't miss an all new behind the scenes look at the highly anticipated major motion picture with a sneak peek at some of the art!"}, {"titre": "The Mighty Thor (2011) #1", "description": "It's a shining, golden, new age for the Thunder God and Matt Fraction and Olivier Coipel are back to lead the charge! Thor and Sif dive deep into the heart of the fractured World Tree to reclaim an artifact from beyond time and space, an artifact that attracts the attention of the Silver Surfer. And when a herald such as he arrives on Earth, the arrival of his master is certain to follow. Prepare for the return of the World Eater...prepare for the return of Galactus! Fans can't miss an all new behind the scenes look at the highly anticipated major motion picture with a sneak peek at some of the art!"}, {"titre": "The Mighty Thor (2011) #1 (Simonson Variant)", "description": "It's a shining, golden, new age for the Thunder God and Matt Fraction and Olivier Coipel are back to lead the charge! Thor and Sif dive deep into the heart of the fractured World Tree to reclaim an artifact from beyond time and space, an artifact that attracts the attention of the Silver Surfer. And when a herald such as he arrives on Earth, the arrival of his master is certain to follow. Prepare for the return of the World Eater...prepare for the return of Galactus! Fans can't miss an all new behind the scenes look at the highly anticipated major motion picture with a sneak peek at some of the art!"}, {"titre": "The Mighty Thor (2011) #1 (Movie Variant)", "description": "It's a shining, golden, new age for the Thunder God and Matt Fraction and Olivier Coipel are back to lead the charge! Thor and Sif dive deep into the heart of the fractured World Tree to reclaim an artifact from beyond time and space, an artifact that attracts the attention of the Silver Surfer. And when a herald such as he arrives on Earth, the arrival of his master is certain to follow. Prepare for the return of the World Eater...prepare for the return of Galactus! Fans can't miss an all new behind the scenes look at the highly anticipated major motion picture with a sneak peek at some of the art!"}, {"titre": "Marvel Masterworks: The Fantastic Four Vol. 6 Variant (DM Only) (Trade Paperback)", "description": "Continuing their greatest-hits streak on the \"The World's Greatest Comic Magazine,\" Stan Lee and Jack Kirby weren't content just to introduce the Inhumans, Galactus and the Silver Surfer. No, a three-peat was thinking far, far smaller than the most amazing team in comics' history imagined. Their followup was a heart-wrenching tale of tragedy and heroism titled \"This Man! This Monster!\" If this story doesn't make you come to love Benjamin J. Grimm, then yer heart must be made of orange rock, fella! Because the greatest Fantastic Four story wasn't enough, Stan and Jack had yet another unmatched milestone waiting in the wings: the debut of the world's first African super hero, the Black Panther, and his kingdom of Wakanda! And that's just the start! In the pages of this MARVEL MASTERWORKS, you'll also encounter the vile Klaw; see the Silver Surfer go toe-to-toe with the Thing; watch the Human Torch face his namesake, the original 1940s Torch; and wonder in shock and awe at how the Fantastic Four can hope to overcome Dr. Doom when he's wrested the Power Cosmic from the Surfer himself! We can't guarantee you won't wear out the pages of this volume reading stories this great again and again! You may want to order two just in case! Collecting FANTASTIC FOUR #51-60 and ANNUAL #4."}, {"titre": "Silver Surfer (2010) #3", "description": "The Silver Surfer has always served the greater good. And now, with Galactus' power at his fingertips, the High Evolutionary holds the world in his hands. A humbled Surfer will have to choose sides, and if he chooses poorly, the Earth is lost!"}, {"titre": "Annihilators (2010) #2", "description": "The Spaceknights and the Dire Wraiths have returned! As the Wraith's deadly foul magic returns, the home world of the Spaceknights looks as if it will be the first to fall. Only the Annihilators stand between the Wraiths and galactic conquest!"}, {"titre": "Deadpool Team-Up (2010) #883 (YOUNG VARIANT)", "description": "The country is in the middle of an economic meltdown and everyone is feeling the burn, especially your favorite Merc with a Mouth.  Deadpool realizes that there's no government bailout for super-powered mercenaries and when clients stop paying up, he's forced to do the unthinkable... Look for a job. Luckily, Galactus has a position open in the Herald department. Don't miss the face-melting final issue of the series that shook the comic book world to it's very core."}, {"titre": "Deadpool Team-Up (2009) #883", "description": "The country's in the middle of a recession and everyone's feeling it, especially your favorite Merc with a Mouth. When clients stop paying, Deadpool's forced to do the unthinkable...find a job. Luckily, a position's open in Galactus' Herald department!"}, {"titre": "Silver Surfer (2010) #2", "description": "The High Evolutionary's plan to harness the power of Silver Surfer-Herald of Galactus-to further his enigmatic goals has been hatched! What can the Sentinel of the Spaceways do to save himself and the cosmos?"}, {"titre": "Annihilators (2010) #1 (GARNER VARIANT)", "description": "Because you -- yes,you! -- demanded it: Marvel's all-star cosmic team - and cult faves Rocket Raccoon & Groot - in one massive mini! The Silver Surfer! Beta-Ray Bill! Gladiator! Quasar! Ronan! When the Dire Wraiths strike, Cosmic Masters DnA (THE THANOS IMPERATIVE, THOR/IRON MAN) and Tan Eng Huat (SILVER SURFER, THOR: FIRST THUNDER) assemble the heaviest hitters in all the universe to save the day! And there's more! Plus: the demented duo of Rocket Raccoon and Groot return for their own, new-reader-friendly adventure! What do you do after you've saved the galaxy? DnA and the fabulous Timothy Green II (STAR-LORD) answer that with madcap SF combat and swashbuckling, space-faring mayhem!"}, {"titre": "Annihilators (2010) #1", "description": "The Marvel U's most powerful heroes come together for the fight of their lives! When the Dire Wraiths strike, the Annihilators assemble the heaviest hitters in the entire universe to save the day!"}, {"titre": "Thanos Imperative (Hardcover)", "description": "The dangerous and mysterious fissure known as the Fault has opened, and the dark forces of a rival universe where there is no death are pouring through to claim ours! Nova, the Silver Surfer, Quasar, Gladiator and more of the greatest cosmic champions of the Marvel Universal line up to stop them - but it could be more than even they can handle. Luckily, Star-Lord, Rocket Raccoon and some of the galaxy's underdog, never-say-die heroes have a plan. It's a crazy plan. It's called...Thanos! Welcome to the end of everything, brought to you by acclaimed writers Dan Abnett and Andy Lanning and superstar artist Miguel Sepulveda (THUNDERBOLTS)! Collecting THE THANOS IMPERATIVE: IGNITION, THE THANOS IMPERATIVE #1-6, THE THANOS IMPERATIVE: DEVASTATION and THANOS SOURCEBOOK."}, {"titre": "Silver Surfer (2010) #1", "description": "The sentinel of the spaceways walks the Earth once more, a stranger feared by many. Only the HIGH EVOLUTIONARY understands his true potential, but the Evolutionary's mysterious grand design may cost the Surfer everything and change the cosmic balance forever! He's traded blows with Thor and matched wits with Mephisto, but can the herald of Galactus survive the judgment of NORRIN RAND, the man within the Silver Surfer? It's a character-defining epic showing the Silver Surfer as you've never seen him before, brought to you by \"Planet Hulk\" writer Greg Pak and \"Dark Wolverine\" artist Stephen Segovia."}, {"titre": "Chaos War (2010) #5", "description": "THIS IS IT!! THE MARVEL UNIVERSE'S LAST STAND!  The Chaos King unleashes his ultimate attack against reality as we know it -- and our survival depends on a boy, his god, and their ragtag band of allies: The Mighty Thor! The Incredible Hulks! The Dead (and Living?) Avengers! The X-Men! Alpha Flight! But are they enough to stand against THE ANTI-ETERNITY ... The force that seeks to negate all existence itself? In this issue, the universe dies and everyone wins! ...What?"}, {"titre": "Fantastic Four (1998) #583 (3RD PRINTING VARIANT)", "description": "Now joined by artist Steve Epting (CAPTAIN AMERICa) , Jonathan Hickman's tenure on FANTASTIC FOUR hits critical mass with \"THREE\", running through FF #583-588. The War of Four Cities has begun, and when it's run its course, one member of the Fantastic Four will have breathed their last! Change is in the air as the World's Greatest Comic Magazine lives up to its motto! While the Fantastic Four have to deal with an uprising in the Forever City of the High Evolutionary, back home in the Baxter Building Val finds her father's Bridge machine and learns the Cost of Solving Everything. It's the return of Doctor Doom and the debut of superstar artist Steve Epting in THREE, part 1: 'In Lateveria, the Flowers Bloom in Winter. Rated A ...$2.99"}, {"titre": "Fantastic Four (1998) #584 (2ND PRINTING VARIANT)", "description": "It's the return of Galactus, a trip to Nu-World, the Old Kings of Atlantis and Namor, the all-new Yancy Street Gang, and the day the Thing becomes human again. Join Jonathan Hickman and superstar artist Steve Epting in THREE, part 2: 'Congratulations, Mr. Grimm...You're Human Again.'' Rated A ...$2.99"}, {"titre": "Fantastic Four (1998) #585 (2ND PRINTING VARIANT)", "description": "FANTASTIC FOUR #585 Written by JONATHAN HICKMAN Penciled by STEVE EPTING Cover by ALAN DAVIS World's apart from each other, the Fantastic Four embark on their individual journeys with one destined to end in tragedy and change the face of Marvel's first family. It's THREE, part 3:'The Last Kings of Atlantis'! 32 PGS./Rated A ...$2.99"}, {"titre": "Fantastic Four (1998) #586 (2ND PRINTING VARIANT)", "description": "As the army of the Anti-priest begins an invasion of the Baxter Building, and the Invisible Woman is caught in between the warring factions of New and Old Atlantis, Reed Richards must decide the fate of the Earth amidst the chaos of Galactus devouring Nu-World. 32 PGS./Rated A ...$2.99"}, {"titre": "The Thanos Imperative: Devastation (2010) #1", "description": "THE THANOS IMPERATIVE is over, but who and what has survived? What happened to Thanos? What about Lord Mar-Vell and the Cancerverse? Who rules the Kree and the Shi'Ar? Is anyone left to guard the galaxy?"}, {"titre": "Fantastic Four (1998) #586", "description": "THREE PART 4 As the army of the Anti-priest begins an invasion of the Baxter Building, and the Invisible Woman is caught in between the warring factions of New and Old Atlantis, Reed Richards must decide the fate of the Earth!"}, {"titre": "Chaos War (2010) #4", "description": "The Marvel Universe's shattered pantheons fall from the skies! King Chaos marshals his forces for the final assault with every Marvel hero as his target! Hercules, Thor and the God Squad embark upon one last, mad scheme to save existence itself!"}, {"titre": "Fantastic Four (1998) #585", "description": "THREE PART 3 Worlds apart from each other, the Fantastic Four embark on their individual journeys. One member won't make it back..."}, {"titre": "The Thanos Imperative (2010) #6", "description": "The war against the abominable Cancerverse reaches its climax. Only Thanos can decide the fate of two universes, but what choice will he make?"}, {"titre": "Chaos War (2010) #3", "description": "The Chaos King's army of slave gods, including an undead (and angry) Ares, God of War, takes on every divine pantheon on Earth! Can Thor, Hercules and the God Squad rally Earth's feuding gods to beat back their common enemy and save existence itself?"}, {"titre": "Fantastic Four (1998) #584", "description": "THREE PART 2 In this issue: the return of Galactus, a trip to Nu-World, the Old Kings of Atlantis and Namor, the all-new Yancy Street Gang, and the day the Thing becomes human again."}, {"titre": "Chaos War (2010) #2", "description": "When the greatest threat the Marvel Universe has ever seen lays waste to reality and brings Earth's mightiest heroes to their knees, who you gonna call? That's right: the all-new, all-different, all-divine God Squad!"}, {"titre": "The Thanos Imperative (2010) #5", "description": "Thanos is outnumbered and outgunned by the Cancerverse forces, and his unlikely allies-Star-Lord, Rocket Raccoon and the other brave misfits-find themselves making a last stand to save the galaxy's #1 villain!"}, {"titre": "Fantastic Four (1998) #583", "description": "THREE PART 1 The War of Four Cities has begun, and when it's run its course, one member of the Fantastic Four will have breathed their last!"}, {"titre": "The Thanos Imperative (2010) #4", "description": "In the Cancerverse itself, Star-Lord's rag-tag team learns whether attempting to make a deal with Thanos was the smartest choice they ever made or the worst decision of their entire lives!"}, {"titre": "Chaos War (2010) #1", "description": "Since the end of SECRET INVASION, the Chaos King has amassed his army of alien slave gods -- and the time to strike Earth is NOW! Only the greatest Marvel heroes can oppose him -- all led by the newly-returned god of heroes...Hercules!\n"}, {"titre": "The Thanos Imperative (2010) #3", "description": "As the staggering consequences of the Cancerverse's invasion become apparent, Star-Lord and his battered band of heroes fight to protect Thanos, who has actually become the universe's only hope!"}, {"titre": "The Thanos Imperative (2010) #2", "description": "A rival universe where life is the ultimate curse is gouging into our own! Even the great abstract figures of creation like Oblivion and Eternity have taken up arms! What possible significance can Star-Lord and his band of misfit heroes hope to have?"}, {"titre": "The Thanos Imperative (2010) #1", "description": "Nova, The Silver Surfer, Quasar, Gladiator and more of the greatest cosmic champions of the Marvel Universal line up to stop creatures from beyond The Fault, but it could be more than even they can handle."}, {"titre": "Marvel Adventures Super Heroes (2008) #19", "description": "The Avengers have barely moved into their new mansion before they have their first visitor, the super villain known as the Plant Man. But Plant Man isn't crashing the party, he's asking for help in his battle against a violently berserk Silver Surfer, an interstellar powerhouse intent on planting the Plant Man. How much will the Avengers put on the line to protect a super villain, and can even the assembled Avengers stand against the Power Cosmic?"}, {"titre": "Skaar: Son of Hulk (2008) #11", "description": "Too savage for the savage planet of Sakaar, the Son of Hulk has been exiled to the puny little mudball known as EARTH!  Can a confrontation with his father be far behind?  Also -- the return of the Warbound!  These monstrous alien heroes stood by the Green Goliath throughout the epic tales of \"Planet Hulk\" and \"World War Hulk.\"   Now can they save the soul of the Hulk's barbarian boy?  Skaar, Son of Hulk, begins his epic clash with the Marvel Universe with PLANET SKAAR, PART ONE!  \r<br>Parental Advisory ...$2.99\r<br>"}, {"titre": "Skaar: Son of Hulk (2008) #10", "description": "Where the Hulk smashed, the Son of Hulk slaughters.  Where the Hulk found wisdom, the Son of Hulk knows only wrath. But can the shining sojourner known as the Silver Surfer reveal the father to the son and awaken the man within the monster?  And can Skaar in turn thwart the Surfer from leading his master Galactus to feast upon Planet Sakaar and its ancient Old Power?  Shocking revelations and terrifying twists await as Skaar and the Silver Surfer face off one last time -- with the fate of billions in the balance!\r<br>Parental Advisory ...$2.99"}, {"titre": "Skaar: Son of Hulk (2008) #9", "description": "Where the Hulk smashed, the Son of Hulk slaughters.  Where the Hulk found wisdom, the Son of Hulk knows only wrath. But can the shining sojourner known as the Silver Surfer reveal the father to the son and awaken the man within the monster?  And can Skaar in turn thwart the Surfer from leading his master Galactus to feast upon Planet Sakaar and its ancient Old Power?  Shocking revelations and terrifying twists await as Skaar and the Silver Surfer face off one last time -- with the fate of billions in the balance!\r<br>Parental Advisory ...$2.99"}, {"titre": "Marvels: Eye of the Camera (2008) #4", "description": "As Phil Sheldon tries to cope with personal tragedy, he's offered the chance to witness and record a great heroic moment as the Avengers (with the Silver Surfer and the Molecule Man) save the entire planet!"}, {"titre": "Skaar: Son of Hulk (2008) #8", "description": "The first time the Silver Surfer came to Planet Sakaar, he was enslaved as a gladiator and became the most terrifying combatant the Great Games had ever seen. But now the whole globe trembles -- for the Silver Savage has returned, not as a mere gladiator -- but as the Herald of Galactus, Devourer of Worlds!  The children of Sakaar turn to the Son of Hulk for succor -- but what hope have they now that Skaar has allied himself with his father's greatest enemy?\r<br>Parental Advisory ...$2.99\r<br>"}, {"titre": "Skaar: Son of Hulk (2008) #7", "description": "The soothsayers sing:  One day, green-hued giants will clash on the broken battlefields of savage Sakaar.  One day the son\r<br>will confront the father who abandoned him to monsters and madmen.  But before Skaar can meet the Hulk, he must\r<br>survive today's terrible clash.  And even with all his rage and strength, what hope can he have against the return of the\r<br>SILVER SAVAGE? The Silver Surfer returns to Sakaar as a new story-arc begins!\r<br>Parental Advisory ...$2.99\r<br>"}, {"titre": "X-Men Vs. Apocalypse Vol. 2: Ages of Apocalypse (Trade Paperback)", "description": "The Shi'Ar on the Moon, Cable and his wife in Egypt, Wolverine in the Negative Zone - what's wrong with this picture? Apocalypse has risen from the past to change timelines until he finds one he likes - but when the original X-Man looks him in the eye, both men are lost, leaving the X-Men to comb the world for friend and enemy alike! Will Cyclops literally become the thing he fears and hates the most, and vice versa? And where does the Red Skull fit into all of this? Anywhere he wants to! Guest-starring the Hulk, Machine Man, Deathlok and more! Collecting X-51 #8, UNCANNY X-MEN #378 and ANNUAL 1999, CABLE #77, WOLVERINE #148,\r<br>X-MEN UNLIMITED #26, X-MEN #98 and X-MEN: THE SEARCH OF CYCLOPS #1-4.\r<br>Rated T+ ...$29.99 \r<br>ISBN: 978-0-7851-2264-7\r<br>"}, {"titre": "Nova (2007) #15", "description": "He's attempted to save evacuees, he's tried to bring down a horrifying serial killer, he's even gone one-on-one with the Silver Surfer...but now our lone space cop must take his the fight to Galactus himself!"}, {"titre": "Nova (2007) #14", "description": "He's got the power of the entire Nova Force. He's faced down the likes of Sphinx and Annihilus. But is the Human Rocket even in the same league as the Devourer of Worlds and his most famous herald?"}, {"titre": "Silver Surfer: In Thy Name (2007) #4", "description": "The Surfer resorts to desperate measures in his cosmic quest to avert galactic war. But, with patience running low and tempers burning bright, his one hope of restoring peace...is the threat of total annihilation. This one's got it all, folks: turmoil, tragedy, and Terror From Beyond the Stars! Spurrier and Huat's alien extravaganza roars to its sky-shaking finale, with the fate of worlds hanging in the balance!\r<br>Rated A...$2.99\r<br>"}, {"titre": "Silver Surfer: In Thy Name (2007) #3", "description": "Phase-crucifixions! Astral squid-beasts! Conniving aristocrats! Tangled in all the obstacles and oddities of an exotic Empire, the Silver Surfer finds that his toughest test-to soothe the hatred of ancient enemies-is beyond even the Power Cosmic. But is he prepared to commit the ultimate atrocity to secure a chance for peace...? Cosmic craziness turns to darkness and death, as Spurrier and Huat's galactic extravaganza takes an unexpected turn with the surprise appearance of a looming figure from the Surfer's past...\r<br>Rated A ...$2.99 \r<br>"}, {"titre": "Silver Surfer: In Thy Name (2007) #2", "description": "Seeking only to help the helpless, the Silver Surfer rids an alien city of a demonic threat and is declared a Savior by its beleaguered inhabitants. As assassinations, political maneuverings and simmering tensions fester in the shadows, the Surfer must question whether a figurehead - even a reluctant one - is responsible for the actions of his disciples...Brewing conflict leaps from the page, as artist Tan Eng Huat (Doom Patrol, Batman) and writer Simon Spurrier (2000AD, Gutsville) step-up a gear in the Surfer's most explosive adventure yet.\r<br>Rated A ...$2.99\r<br>"}, {"titre": "Silver Surfer: In Thy Name (2007) #1", "description": "The Silver Surfer delves alone into the furthest depths of the void; tangling with organ-stealing pirates, demonic beasts and a race of alien aristocrats. Everyone's favorite Cosmic Wanderer discovers that even in the midst of a galactic utopia, horror is never far away...With electrifying artwork by the dynamic Tan Eng Huat (Doom Patrol, Batman) and an endlessly inventive script by Simon Spurrier - the writer behind the sold-out Gutsville - In Thy Name promises to be this fall most spectacular Alien Extravaganza!\r<br>Rated A ...$2.99 \r<br>"}, {"titre": "Annihilation Book 2 (Trade Paperback)", "description": "A gathering of forces! The Annihilation Wave has scoured the galaxy for the one-time heralds of Galactus - forcing the Silver Surfer to seek out his former master and prepare for a cataclysmic battle with primordial foes! As the Annihilation Wave spreads into Kree and Skrull space, witness the Super-Skrull's personal quest to combat Annihilus from the Negative Zone for the life of his son! And the recently ousted Ronan the Accuser sets to clear his name, only to come face-to-face with an army of powerful women led by Gamora! Meanwhile, Thanos and Annihilus have forged an alliance - but what do they seek? Collecting ANNIHILATION: SILVER SURFER #1-4, ANNIHILATION: SUPER-SKRULL #1-4 and ANNIHILATION: RONAN #1-4.\r<br>320 PGS./Rated A ...$24.99"}, {"titre": "Marvel Adventures Fantastic Four (2005) #28", "description": "The populace of Earth hates and fears the stranded SILVER SURFER. But he falls in with a TV self-help guru who encourages him to win the planet over to his side -- by solving all the world's problems! Wielding the Power Cosmic, the Silver Surfer single-handedly wipes out famine, poverty and war, becoming the most popular super hero ever -- as well as the greatest threat to Earth's continued existence! Why does the Fantastic Four have to stop the Surfer from...saving the world?\r<br>32 PGS./All Ages ...$2.99\r<br>"}, {"titre": "Silver Surfer: Requiem (2007) #4", "description": "\"AGNUS DEI\"\r<br>\r<br>The latest offering from the Marvel Knights line concludes!\r<br>For untold years, Norrin Radd surfed the galaxy, exploring the darkness between stars, witnessing the rise and fall of vast civilizations.  Now his ride comes to an end.  Zenn-La, the planet of his birth, the planet he saved through his own sacrifice -- the Silver Surfer crossed the galaxy to draw his last breath here.  He's home.  What waits for him?\r<br>\r<br>32 PGS./Card Stock Cover/Rated T+ ...$3.99\r<br>"}, {"titre": "Silver Surfer: Requiem (2007) #3", "description": "\"SANCTUS\"\r<br>\r<br>Another offering from Marvel Knights.  Guest-starring Dr. Strange!!\r<br>His time is short and getting shorter.  Like a fish swimming upstream, the Silver Surfer is drawn to the familiar waters that birthed him.  But the path to Zenn-La is neither clean nor straight.  To reach his destination, the Surfer must travel through a battlefield of unimaginable scale, and cut to the heart of a Sacred War that has raged for untold eons.  Is there time for one last stab at redemption?\r<br>\r<br>32 PGS./CARDSTOCK COVER/Rated T+ ...$3.99\r<br>"}, {"titre": "Marvel Adventures Fantastic Four (2005) #26", "description": "A massive alien refugee fleet streams through our solar system, bearing the warning: \"Galactus is coming! Galactus is coming!\" And right behind them is the World-Devourer's herald, the SILVER SURFER -- headed straight for Earth! Reed Richards has only a few days to evacuate the planet before it's destroyed ... or, failing that, figure out a way to somehow stop the unstoppable!\r<br>\r<br>32 PGS./All Ages ...$2.99\r<br>"}, {"titre": "Silver Surfer: Requiem (2007) #2", "description": "The latest offering from the Marvel Knights line.  Guest-starring Spider-Man!\r<br>For untold years, Norrin Radd has surfed the galaxy, exploring the darkness between stars, witnessing the rise and fall of vast civilizations.  Now his ride is about to come to an end.  It starts with a small spot -- a blemish that will spread until he is no more.  Until then, the Silver Surfer will undertake his final voyage -- to the one destination that has always eluded him.  But first, a much-needed consultation with an old friend -- Spider-Man... \r<br>32 PGS./CARDSTOCK COVER/Rated T+ ...$3.99\r<br>"}, {"titre": "Bullet Points (Trade Paperback)", "description": "World War II. America needs a super soldier. Only one man possesses the formula to create the perfect fighting machine from volunteer Steve Rogers. But when a deadly bullet kills Dr. Erskine along with his bodyguard, M.P. Ben Parker, Steve's destiny - and that of the Marvel Universe - is changed forever. Collecting BULLET POINTS #1-5.\r<br>144 PGS./Rated T+ ...$13.99\r<br>ISBN: 0-7851-2010-6\r<br>"}, {"titre": "Essential Silver Surfer Vol. 2 (Trade Paperback)", "description": "After years of Earthbound exile, the Silver Surfer soars the seas of space once more and finds plenty of peril awaiting when the Elders of the Universe try something new: all-out war on Galactus! Plus: space piracy, intergalactic war, doppelgangers and the Surfer caught in an interstellar love triangle! Guest-starring the Fantastic Four, the Eternals, and Annihilation's Ronan and Super-Skrull! Plus: a rare glimpse of a path not traveled on an alternate Earth! Collecting SILVER SURFER (1982) #1, SILVER SURFER (1987) #1-18 and ANNUAL #1, and MARVEL FANFARE #51.\r<br>584 PGS./Rated T+ ...$16.99\r<br>ISBN: 0-7851-2700-3\r<br>ESSENTIAL SILVER SURFER VOL. 1 TPB STILL AVAILABLE!\r<br>$16.99 (ISBN: 0-7851-2008-4)\r<br>"}, {"titre": "Silver Surfer: Requiem (2007) #1", "description": "The latest offering from the Marvel Knights line. Guest-starring the Fantastic Four! \r<br>For untold years Norrin Radd has surfed the galaxy, exploring the darkness between stars, witnessing the rise and fall of vast civilizations.  Now his ride is about to come to an end.  It starts with a small spot -- a blemish that will spread until he is no more.  Until then, the Silver Surfer would undertake his final voyage -- to the one destination that has always eluded him.  His journey starts where it began.\r<br>32 PGS./CARDSTOCK COVER/Rated T+ ...$3.99 \r<br>"}, {"titre": "Silver Surfer Omnibus Vol. 1 (Trade Paperback)", "description": "Born by the hand of the world-devourer, Galactus, Norrin Radd sacrificed himself to save his home planet and his true love, Shalla-Bal, but the price of their lives was servitude to the mighty Galactus - as his herald, the Silver Surfer! Now, exiled upon Earth, he struggles to understand the beauty and humanity of mortal men, and nobly seeks to heal the rifts that separate man from his brothers.\r<br>Created by the titanic team of Stan Lee and Jack Kirby in the pages of FANTASTIC FOUR, the Silver Surfer went on to become one of the most-beloved characters in all comicdom. Embodying the mind-blowing concepts of Kirby and Stan's socially conscious writing craft, the Surfer's stories expressed their creative vision in staggering and unique tales. Another talent would touch the character, however, granting him a soul-wrenching humanity that helped define him to this very day: the one and only John Buscema! A master of the craft, Buscema's Silver Surfer is considered by many to be the peak of comic-book art.\r<br>Now, the original adventures of the Silver Surfer are presented in one complete volume! Containing every story and letters page, restored and recolored to match the original issues, plus behind-the-scenes bonuses and critical essays, this book is the guaranteed way to get in on the character in the upcoming Fantastic Four film!\r<br>Collecting SILVER SURFER #1-18.\r<br>576 PGS./All Ages ...$74.99\r<br>"}, {"titre": "Ultimate X-Men Vol. 16: Cable (Trade Paperback)", "description": "If one man is capable of disrupting the carefully controlled world of Charles Xavier's School For Gifted Youngsters, it's this one: Ultimate Cable! He comes from a tragic future to wreak havoc on mutantkind today, and his sinister secrets will shock the X-Men to their very core. It's a huge event in Ultimate X-Men history. Get in on the ground floor. You've been warned. Plus: Delve into the secret life of the X-Men's rivals, Emma Frost's Academy of Tomorrow, in a special bonus story! Collecting ULTIMATE X-MEN #75-80.\r<br>160 PGS./Rated T+ ...$14.99\r<br>"}, {"titre": "Fantastic Four (1998) #545", "description": "The New FF has a doozy of a first job...stopping Galactus and the Silver Surfer!"}, {"titre": "Bullet Points (2006) #5", "description": "The incredible conclusion of the story of the Marvel Universe turned on its side after one bullet changes the entire course of history during World War Two. With the fate of the Fantastic Four drastically changed, what hope does Earth have in the face of Galactus, the destroyer of worlds?!\r<br>32 PGS./Rated T+ ...$2.99\r<br>"}, {"titre": "Stan Lee Meets... (Hardcover)", "description": "Celebrating the 65th anniversary of Stan Lee's employment at Marvel Comics! In five all-new 10-page tales written by \"The Man\" himself, Stan meets his web-slinging creation, journeys to Greenwich Village to catch up with his old pal Doctor Strange, is abducted to Latveria by the sinister Doctor Doom, makes the mistake of bicycling past Yancy Street and surfs the stars with a certain silver-skinned space-farer! Plus: Today's hottest writers and artists pay homage to Stan's life and career in five new 10-page stories. Also featuring classic Stan-scripted stories from AMAZING SPIDER-MAN #87, FANTASTIC FOUR #79 and #87, MARVEL PREMIERE #3, and SILVER SURFER #14! Collecting STAN LEE MEETS SPIDER-MAN, DR. STRANGE, DR. DOOM, THE THING and SILVER SURFER.\r<br>240 PGS./Rated T+ ...$24.99\r<br>"}, {"titre": "Bullet Points (2006) #4", "description": "The ripple effects continue through JMS and Tommy Lee Edwards' alternate Marvel Universe. What strange twist will lead to the creation of the Spider-Man, who will replace Steve Rogers as the new Iron Man and what monumental presence threatens the very existence of humanity?\r<br>32 PGS./Rated T+ ...$2.99\r<br>"}, {"titre": "Annihilation (2006) #6", "description": "Nova and Annihilus face off in a fight to the finish with the fates of two, count 'em, two, universes at stake.  You think that's bad?  Wait until you see what happens when Galactus decides to go to war."}, {"titre": "Cable & Deadpool Vol. 2: The Burnt Offering (Trade Paperback)", "description": "A floating city promises hope for humans and mutants alike! But if Cable plans to be Earth's Savior, will Deadpool accept the role of Judas? Plus: the traumatic, tragic, and tantric events of \"The Burnt-Offering\" have left Cable - well, \"regurgitated\" - now Deadpool has to save the day! Even if it means confronting his fear of very big-headed villains! And the challenge of finding someone who can fix technology from thousands of years in the future. Collects Cable/Deadpool #7-12."}, {"titre": "Avengers Assemble Vol. 4 (Hardcover)", "description": "The Avengers embark on international adventure against a nation-sized knight and a city of Hulks! Then, it's off to small-town Centerville to face Salem's Seven and the Sons of the Serpent! Plus: A major Marvel crossover! Avengers in space, and inquiries answered by the man who knows Earth's Mightiest Heroes best! Collecting AVENGERS #35-40 and ANNUAL 2000-2001, AVENGERS: THE ULTRON IMPERATIVE, and MAXIMUM SECURITY #1-3 and DANGEROUS PLANET.\r<br>416 PGS./Rated T+ ...$34.99\r<br>"}, {"titre": "Bullet Points (2006) #3", "description": "The story of an alternate Marvel Universe, changed by a single bullet, continues to unravel! Peter Parker-now transformed into a hideous Hulk-battles Iron Man, Steve Rogers, to the death and scientist Reed Richards blasts off towards his ultimate destiny as the world's greatest super spy! \r<br>32 PGS./Rated T+ ...$2.99 \r<br>"}, {"titre": "Annihilation (2006) #5", "description": "With the war lost, Ronan and the very, very angry Super-Skrull kill their way to the heart of the Kree Empire. VIVE LA KREE!"}, {"titre": "Heroes Reborn: Avengers (Trade Paperback)", "description": "Cap, Thor, the Vision, Hawkeye, Hellcat, Mantis and more: The Avengers lineup is both new AND classic on an Earth that hits them with villains as fast as they can assemble! Revised versions of Ultron, the Radioactive Man, the Grim Reaper and many more prove their mastery of evil against Reborn Earth's mightiest heroes! Plus, the Heroes Reborn Universe only got a piece of the Hulk - but, darn it, it may still be more than it can handle! Guest-starring Nick Fury and the \r<br>Fantastic Four! Collects AVENGERS (VOL. 2) #1-12.\r<br>336 PGS./Rated A ...$29.99  \r<br>"}, {"titre": "Bullet Points (2006) #2", "description": "With military policeman Ben Parker killed during the assassination of Dr. Abraham Erskine (the developer of the Super Soldier serum), Peter Parker has become a disenchanted teen, angry at the world. After he wanders in front of the path of a gamma bomb test, how dangerous does the combination of a lonely, angry boy and the lethal power of a rampaging Hulk-ish monster become? Steve Rogers, the WWII hero known as Iron Man, is about to find out.\r<br>32 PGS./Rated T+ ...$2.99\r<br>"}, {"titre": "Stan Lee Meets Silver Surfer (2006) #1", "description": "The last in a series of stand-alone specials celebrating the 65th Anniversary of Stan Lee's employment at Marvel! First, Stan is summoned by the planet-devourer Galactus to deal with the problem of his silver-skinned herald! Next, Paul Jenkins and Pasqual Ferry pay homage to the life and career of \"The Man.\" And finally, a classic reprint of the Stan-scripted SILVER SURFER #14, guest-starring Spider-Man! \r<br>48 PGS./Rated T+ ...$3.99\r<br>"}, {"titre": "Marvel Comics Presents: Wolverine Vol. 4 (Trade Paperback)", "description": "The mayhem-loving mutant faces occult intrigue against Abdul Alhazred, while fallout from the Acts of Vengeance brings him face to facelessness with the ninjas of Deathwatch! Wolverine does it again, and he does it the best! Guest-starring Ghost Rider! Collects MARVEL COMICS PRESENTS #62-71.\r<br>104 PGS./Rated T+ ...$12.99\r<br>"}, {"titre": "Bullet Points (2006) #1", "description": "World War II. America needs a super soldier. Only one man possesses the formula to create the perfect fighting machine from volunteer Steve Rogers. But when a deadly bullet kills Dr. Erskine along with his bodyguard, M.P. Ben Parker, Steve's destiny-and that of the Marvel Universe-is changed forever. \r<br>32 PGS./Rated T+ ...$2.99\r<br>"}, {"titre": "Heroes Reborn: Fantastic Four (Trade Paperback)", "description": "The Fantastic Four are Reborn, but it could be a short and unwonderful life as menaces emerge from the earth, the sea and Latveria! But even the Mole Man, Namor and Doom himself pale before the threat of Galactus and his Heralds (one finally just wasn't enough)! Featuring the Avengers, S.H.I.E.L.D. and more! Guest-starring Wolverine and Franklin Richards, Son of a Genius! Collects FANTASTIC FOUR (Vol. 2) #1-12.\r<br>336 PGS./Rated A ...$29.99 \r<br>The Fantastic Four are Reborn, but it could be a short and unwonderful life as menaces emerge from the earth, the sea and Latveria! But even the Mole Man, Namor and Doom himself pale before the threat of Galactus and his Heralds (one finally just wasn't enough)! Featuring the Avengers, S.H.I.E.L.D. and more! Guest-starring Wolverine and Franklin Richards, Son of a Genius! Collects FANTASTIC FOUR (Vol. 2) #1-12.\r<br>336 PGS./Rated A ...$29.99 \r<br>"}, {"titre": "Ultimate X-Men (2000) #75", "description": "CABLE PART 1 Jean's powers are becoming difficult to control. What lengths will Xavier go to ensure she is stabilized? Plus, the X-Men are attacked by someone with intimate knowledge of their powers and tactics! Who is this mystery man?"}, {"titre": "Decimation: Sentinel Squad O*N*E (Trade Paperback)", "description": "Discover the origin of the Sentinel Squad! How did they come together and become the elite group of soldiers to pilot the Sentinels that have made their presence known at the Xavier Institute? Collects SENTINEL SQUAD O*N*E* #1-5.\r<br>120 PGS./Rated T+ ...$13.99\r<br>"}, {"titre": "Annihilation: The Nova Corps (2006) #1", "description": "Get caught up on all of the players in the Annihilation event - just in time for this month's ANNIHILATION #1! Featuring Annihilus, Nova, Ronan, the Silver Surfer, the Super-Skrull, Thanos and more - all from the Xandarian Worldmind files of the Nova Corps!\r<br>48 PGS NO ADS/Rated A ...$3.99\r<br>"}, {"titre": "Annihilation (2006) #1", "description": "One empire has fallen. Two heroes are dead.It all comes together here! Individually, the Silver Surfer, Super-Skrull, Ronan and Nova have faced down the Annihilation Wave... and lost! Now, they must unite those who remain or die by Annihilus' hand!  The Annihilation has only begun!"}, {"titre": "Annihilation: Silver Surfer (2006) #4", "description": "It all comes to a head in this issue as the Surfer confronts the sins of his past and, more importantly, determines his future path.  Whatever you were expecting, we guarantee, this wasn't it.  It's a whole new, senses staggering chapter in the Surfer's ongoing saga!\r<br>Interlocking cover with all three other ANNIHILATION covers! \r<br>Guest starring FIRELORD, GALACTUS, and THANOS!\r<br>32 PGS./Rated A ...$2.99\r<br>"}, {"titre": "Last Planet Standing (2006) #5", "description": "Is this the end of the MC-2 Universe? The sequel to last year's surprise hit concludes and it's all-out action in the merry Marvel manner as...\r<br>Determined to evolve, Galactus prepares to sacrifice the Earth and the entire universe! An army of Mainframes take on a horde of Punisher robots!  The Silver Surfer unleashes his full cosmic fury against his former master!  The last heroes standing make their final assault on the planet-eater!  And Spider-Girl and a few friends take a desperate, perhaps fatal, gamble to save their world and the universe entire!\r<br>32 PGS./All Ages ...$2.99\r<br>"}, {"titre": "Earth X (New (Trade Paperback)", "description": "Great epics come along only once in a long while. Stories that push the normal boundaries and force the reader to think. Stories so powerful in message and so grand in scale that the guidelines by which such tales are usually judged are completely rearranged. Spawned from the brilliant creative mind of Alex Ross, EARTH X is one such epic. Along with writer Jim Krueger and artist John Paul Leon, Ross breathes life into and gives amazing detail to every facet of the EARTH X mythos - made evident by everything from his early conceptual pencil sketches to each of his fourteen beautifully painted covers. EARTH X explores the depths and heights of the Marvel Universe, from the roots of its humble beginnings to the peak of its ultimate potential. \r<br>Collects all twelve issues of the EARTH X regular series, and the #0 and #X bookends.\r<br>472 PGS./Rated T+ ...$29.99\r<br>ISBN: 0-7851-2325-3\r<br>"}, {"titre": "Last Planet Standing (2006) #4", "description": "The sequel to the critically acclaimed LAST HERO STANDING continues--!\r<br>A major Marvel Universe character dies!  The Great Elders and Comic Powers of the Universe launch a desperate attack against Galactus! The citizens of Earth are ordered to evacuate the planet! New York City is targeted for destruction! The Silver Surfer joins the fray! And the action hits overdrive as the Avengers, Spider-Girl and the Fantastic Five prepare to make their final stand!\r<br>32 PGS./All Ages ...$2.99 \r<br>"}, {"titre": "Annihilation: Silver Surfer (2006) #3", "description": "GUEST STARRING THANOS!\r<br>GUEST STARRING GALACTUS!\r<br>Can even the combined might of the ex-heralds of Galactus stand against an all out assault by the Annihilation Wave?  It gets worse.  Thanos, the near omnipotent mad Titan, commands the Annihilation wave assault.  It gets EVEN worse. With the heralds otherwise occupied, a shocking character moves to strike at Galactus!  You don't want to miss this one!  No.  Really.  You don't.\r<br>32 PGS./Rated T+ ...$2.99\r<br>"}, {"titre": "Last Planet Standing (2006) #3", "description": "The sequel to the critically acclaimed LAST HERO STANDING continues--!\r<br>A major Marvel Universe character dies!  The Great Elders and Comic Powers of the Universe launch a desperate attack against Galactus! The citizens of Earth are ordered to evacuate the planet! New York City is targeted for destruction! The Silver Surfer joins the fray! And the action hits overdrive as the Avengers, Spider-Girl and the Fantastic Five prepare to make their final stand!\r<br>32 PGS./All Ages ...$2.99"}, {"titre": "Hulk (1999) #95", "description": "The Hulk and his Warbound gladiator allies enter their final battle in the Great Arena - where a familiar face from the Marvel Universe returns as an implacable enemy.  Faced with betrayal, temptation, and the most terrifying battle the Great Arena has ever seen, will the Hulk stand with his Warbound gladiators - or seize the honors of the Empire?"}, {"titre": "Last Planet Standing (2006) #2", "description": "At last! The long awaited sequel to last year's surprise hit, the sold-out LAST HERO STANDING, which Ray Tate of Silver Bullet Comics called \"a comic book mini-series that's worth buying!\"\r<br>For centuries beyond reckoning, Galactus has consumed entire worlds to satiate his never-ending quest for sustenance, but now he has a new plan--one which may threaten the very existence of the entire Universe!  Featuring: the mighty Thor, the Warriors Three, the Avengers, Spider-Girl, the Fantastic Five and the Shi'ar Imperial Guard!\r<br>32 PGS./All Ages ...$2.99 \r<br>"}, {"titre": "Last Planet Standing (2006) #1", "description": "At last! The long awaited sequel to last year's surprise hit, the sold-out LAST HERO STANDING, which Ray Tate of Silver Bullet Comics called \"a comic book mini-series that's worth buying!\"\r<br>For centuries beyond reckoning, Galactus has consumed entire worlds to satiate his never-ending quest for sustenance, but now he has a new plan--one which may threaten the very existence of the entire Universe!  Featuring: the mighty Thor, the Warriors Three, the Avengers, Spider-Girl, the Fantastic Five and the Shi'ar Imperial Guard!\r<br>32 PGS./All Ages ...$2.99 \r<br>"}, {"titre": "Annihilation: Silver Surfer (2006) #2", "description": "The ex-heralds of Galactus unite to combat a common foe.  But can even the combined powers of the Silver Surfer, Firelord, Terrax and Red Shift stand against the Annihilation Wave and it's mad master?  And what dark ambition motivates Thanos to strike a dark alliance with the invading force?\r<br>32 PGS./Rated T+ ...$2.99\r<br>"}, {"titre": "Annihilation: Silver Surfer (2006) #1", "description": "ANNIHILATION continues here!\r<br>\r<br>The Annihilation Wave has targeted the ex-heralds of Galactus. Hunted by beings every bit as powerful as himself, the Silver Surfer must find a way to unite Galactus' ex-heralds against a common foe!\r<br>\r<br>But, can even the united cosmic might of those who served Galactus stand against these powerful beings called Seekers!?\r<br>\r<br>Guest starring: FIRELORD and GABRIEL THE AIR WALKER. \r<br>And introducing RAVENOUS!\r<br>\r<br>\r<br>32 PGS./Rated T+ SUGGESTED FOR TEENS AND UP ...$2.99\r<br>"}, {"titre": "Marvel Masterworks: Ant-Man/Giant-Man Vol. (Hardcover)", "description": "Burned under the magnifying glass of overwhelming demand, Mighty Marvel has given in to give you our smallest hero in his big Masterworks debut! Lee and Kirby's second hero creation, scientist Hank Pym, invented an amazing growth serum and a cybernetic helmet making him the Astonishing Ant-Man! Teamed up with the winsome Wasp, the tiny twosome battle a sensational array of mini- and maxi-sized menaces from the Scarlet Beetle to the Black Knight! And if that's not enough to occupy a man of science, he's also defending the good ol' U.S. of A's secrets from the commie hordes! But we've got more than just miniature mayhem for you, True Believer. You can look forward to the birth of the biggest Avenger there ever was-Giant-Man-so run, don't walk, and reserve your copy today!\r<br>Collecting TALES TO ASTONISH #27, 35-52\r<br>288 PGS./All Ages ...$49.99\r<br>\r<br>MARVEL MASTERWORKS: ANT-MAN/GIANT-MAN VOL. 1 - VARIANT EDITION VOL. 59\r<br>288 PGS./All Ages ...$54.99\r<br>"}, {"titre": "Annihilation: Prologue (2006)", "description": "This is it! 48 pages of cosmic guts and glory! If you want to see your favorite cosmic level heroes and villains, you dare not miss ANNIHIALTION: PROLOGUE! This 48 page (NO ADS!) book is written by Keith Giffen (DRAX THE DESTROYER, THANOS), and features the stunning art of Scott Kolins & Ariel Olivetti. This is the book to read for the NEXT YEAR'S worth of cosmic stories! Get in on the ground floor as Marvel raises these great characters from the ashes!\r<br>Heroes will die. Villains and heroes will form allegiances. Empires will fall.\r<br>FEATURING: NOVA, SILVER SURFER, THANOS, DRAX THE DESTROYER, RONAN THE ACCUSER, AND THE SUPER-SKRULL! \r<br>Retailers take note: this issue kicks off a cosmic event starting in April! \r<br>48 PGS (NO ADS)/T+ SUGGESTED FOR TEENS AND UP ...$3.99\r<br>"}, {"titre": "Silver Surfer: Rebirth of Thanos (Trade Paperback)", "description": "The quest that led to INFINITY GAUNTLET begins here! Back from the dead, Thanos is after the power to bring the rest of the universe with him on a return trip! Can the Silver Surfer, Drax the Destroyer and others stop the cosmic iconoclast before he uses reality as a token of his affection for Death? Special guest-appearance by the Impossible Man! Featuring a rare Thanos solo story not seen in almost thirty years! Collects SILVER SURFER #34-38, THANOS QUEST #1-2 and the Thanos backup from LOGAN'S RUN #6.\r<br>224 PGS./T+ SUGGESTED FOR TEENS AND UP ...$24.99\r<br>"}, {"titre": "Sentinel Squad O*N*E (2006) #2", "description": "Part 2 (of 5)!\r<br>Big mighty robot action! The men and women of Sentinel Squad are given their very first mission, and not all of them are going to get out of it in one piece! The secret origin of the Sentinels continues!\r<br>"}, {"titre": "Avengers: Galactic Storm Vol.1 (Trade Paperback)", "description": "The Kree are one of the Fantastic Four's oldest enemies; the Shi'ar, one of the X-Men's oldest allies. But it's the Avengers who are caught in the middle when the two alien races wage a war to re-write Marvel's map of the universe! As two-legged WMDs land on Earth, the Avengers end up as alien invaders on wartorn worlds of wonder, both as a unit and individually! Featuring the Imperial Guard! Starforce! Deathbird! Thor vs. Gladiator! Super heroes from three galaxies and more clash in the first half of the story that shook the team to its foundations! Collects CAPTAIN AMERICA #398-399, AVENGERS WEST COAST #80-81, QUASAR #32-33, WONDER MAN #7-8, AVENGERS #345-346, IRON MAN #278 and THOR #445.\r<br>280 PGS./RATED T+ ...$29.99\r<br>"}, {"titre": "Marvel Visionaries: Roy Thomas (Hardcover)", "description": "Watch Roy Thomas take the Fantastic Four from the sublime to the ridiculous as the team confronts racism, social injustice and the Impossible Man! Meanwhile, the Vision joins the Avengers! The Hulk finds his way to \"Heaven,\" and Captain Marvel escapes the Murder Maze! The origin of the Invaders! Secrets of Doctor Strange revealed! Dracula in Salem and the X-Men in Japan! And who is Starr the Slayer? Plus: rarely seen stories from Marvel's Silver Age of humor and romance! \r<br>Collects MODELLING WITH MILLIE #44, TALES OF SUSPENSE #73; AVENGERS #35, #57-58 and #100; SUB-MARINER #8 & #14; NOT BRAND ECCH #12; CAPTAIN MARVEL #19; X-MEN #64; CHAMBER OF DARKNESS #4; AMAZING ADVENTURES #8; INCREDIBLE HULK #147; FANTASTIC FOUR #119 and #176; DRACULA LIVES #1; GIANT-SIZE INVADERS #1; and DOCTOR STRANGE #9.\r<br>352 PGS./Rated T+ SUGGESTED FOR TEENS AND UP ...$34.99\r<br>ISBN: 0-7851-2088-2\r<br>"}, {"titre": "Defenders (2005) #1", "description": "Wong possessed by Nightmare!  Dormammu and Umar in unholy alliance!  The Hulk and the Sub-Mariner at each other's throats!  The Silver Surfer...uh...surfing.  Can Doctor Strange reunite the Defenders and save \"Reality As We Know It?\"  Come to think of it, can editor Andy Schmidt save the Marvel Universe from Eisner-award-winning creators Keith Giffen, J.M. DeMatteis and Kevin Maguire? Only the Ancient One knows for sure!\r<br>32 PGS./T+ Suggested for Teens and Up ...$2.99\r<br>"}, {"titre": "Essential Fantastic Four Vol. 4 (Trade Paperback)", "description": "Relive more of the FF's classic exploits as they stand united against Dr. Doom, Annihilus and Galactus! Featuring the first appearances of the Kree and the microversal Psycho-Man! Guest-starring Spider-Man, Daredevil, Thor and the Warlock formerly known as Him! Lee and Kirby were the ones who started it all, and they kept it going in these cosmic tales! Collects FANTASTIC FOUR #64-83 and ANNUAL #5-6.\r\n536 PGS./All Ages ...$16..99"}, {"titre": "G.L.a. (2005) #2", "description": "Part 2 of 4!\r<br>\"DIS-MEMBERSHIP DRIVE\"\r<br>With the life-expectancy of hamsters, and an ever-thinning lineup, the GLA is in desperate need of new blood.  But what self-respecting super-type would sign up for THIS!? Guest stars galore, including Brother Voodoo,  El Aguila, and Captain Ultra.  Plus Spider-Man, Wolverine, Daredevil, and all the other spotlight-hogs you can't get enough of! Oh, and don't forget, in this issue ANOTHER GLAer DIES!  Well... besides Mr. Immortal.\r<br>32 PGS./Marvel PSR ...$2.99\r<br>"}, {"titre": "Marvel Masterworks: The Uncanny X-Men Vol. 5 (Hardcover)", "description": "In celebration of the 25th anniversary and presented here for the first time in full-archival color, including pages straight from the Byrne/Austin originals, the Dark Phoenix Saga! \r<br>Gathered together by Professor Charles Xavier to protect a world that fears and hates them, the X-Men had fought many battles, been on adventures that spanned galaxies, grappled enemies of limitless might, but none of this could prepare them for the most shocking struggle they would ever face. One of their own members, Jean Grey, has gained power beyond all comprehension, and that power has corrupted her absolutely!\r<br>Now they must decide if the life of the woman they cherish is worth the existence of the entire universe!\r<br>Collecting X-Men #132-140, Annual #4 with special bonus features including the original X-Men #137 story where Jean Grey lived \"Phoenix: The Untold Story\" and the Claremont/Buscema Phoenix classic from Bizarre Adventures #27! And if that wasn't enough, brace yourself for a brouhaha with Wendigo and the seminal story of that furry blue elf Nightcrawler in \"Nightcrawler's Inferno.\"\r<br>"}, {"titre": "Cable & Deadpool (2004) #10", "description": "THE BURNT OFFERING PART 4 Cable vs. the Silver Surfer -- and guess who determines the winner? Deadpool holds the key to saving the world...or saving Cable's life...which choice will he make?"}, {"titre": "Silver Surfer (2003) #14", "description": "\"REVELATION\" PART 8 (OF 8) Finally willing to make the ultimate sacrifice in defense of the Earth, the Silver Surfer battles a power far greater than himself."}, {"titre": "Silver Surfer (2003) #13", "description": "Gabe and Ellie, the most evolved of the Silver Surfer's abducted children, unleash the prophesied cataclysm on Earth. The Silver Surfer faces his responsibility for the destruction."}, {"titre": "Silver Surfer (2003) #12", "description": "\"REVELATION\" PART 6 The Silver Surfer's children sabotage his mission, with catastrophic consequences for the Earth."}, {"titre": "Ultimate X-Men Vol. 9: The Tempest (Trade Paperback)", "description": "Bound together by their unique genetic heritage, the mutant members of the X-Men have become more than just a team - they've become a family. But even the strongest family can be ripped apart by tragedy... and the death of one of their own leaves the remaining X-Men struggling to deal with the loss. And even before a moment of silence can pass, the mysterious Mr. Sinister arrives, intent on giving the X-Men a lot more to mourn! Collects ULTIMATE X-MEN #46-49."}, {"titre": "Silver Surfer (2003) #11", "description": "\"REVELATION\" PART 5 The Silver Surfer battles Stewart Acheron's forces, while a mutiny aboard the salvation ark puts the future of the human race at risk!"}, {"titre": "Marvel Masterworks: The Fantastic Four Vol. 7 (Hardcover)", "description": "\"The First Family of Super Heroes ushers in a new era of Marvel Masterworks with the addition of Fantastic Four Vol. 7 to the Masterworks Library! Showcasing the unmatched team-up of Stan Lee and Jack Kirby, this edition is a must-have! Hold on to your seats, True Believers, as the F.F. battle Blastaar, the Living Bomb-Burst, the Sandman, Ronan the Accuser and more! Also featuring the Silver Surfer, the incomparable Inhumans and the first appearance of Him, the man later to be known as Adam Warlock! Collecting Fantastic Four (Vol. 1) #61-71 and Annual #5.\""}, {"titre": "Silver Surfer (2003) #10", "description": "\"REVELATION\" PART 4 (OF 6) An unexpected visitor aboard the Silver Surfer's ship pressures him to rescue Ellie Waters from Stewart Acheron. The Surfer wants to help Ellie, yet fears intervening may somehow trigger the Earth's demise."}, {"titre": "Silver Surfer (2003) #9", "description": "REVELATION PART 3 The Silver Surfer begins to doubt his own mission, just as Gabe Acheron finally accepts the harsh necessity of the Surfer's plans for Earth. Meanwhile, a trusted friend betrays Denise, with Ellie's life at stake."}, {"titre": "Ultimate X-Men (2000) #48", "description": "Mutants are turning up dead -- murdered in New York City. Someone is targeting them. When Charles Xavier learns of this, he puts his X-Men on the trail of the killer. But are Xavier's children of the atom the hunters -- or the hunted? And who is the mysterious figure in shadow that this serial killer follows implicitly? The answer will absolutely shock you!"}, {"titre": "Silver Surfer (2003) #8", "description": "REVELATION PART 2 Hunted by the authorities, Denise Waters grapples with her daughter's dangerous new powers. Meanwhile, the Surfer reveals his plans for the Earth's future…"}, {"titre": "Silver Surfer (2003) #7", "description": "REVELATION PART 1 Though the Silver Surfer has reunited Denise Waters with her daughter, Stewart Acheron intends to claim Ellie as his own - by any means necessary."}, {"titre": "Silver Surfer Vol. 1: Communion (Trade Paperback)", "description": "Small children from around the globe are vanishing without a trace, and reports of the appearance of a gleaming alien figure at the time of their abductions are growing in number. For single mother Denise Walters, caring for her young autistic daughter has been the primary focus of her life - she never imagined becoming embroiled in alien abduction and mankind's possible Armageddon. But that's exactly what happens when the Silver Surfer appears in Denise's home and whisks her daughter away. As Denise delves further into her daughter's abduction, she begins unraveling the mystery of the Surfer's motives. Is his strange and alien mind plotting mankind's salvation, or its ultimate destruction?\r\nCollects the critically acclaimed SILVER SURFER #1-6"}, {"titre": "Silver Surfer (2003) #6", "description": "COMMUNION CONCLUSION The Surfer seeks wisdom beyond the boundaries of space and time, and makes a decision that will transform Denise Waters' life."}, {"titre": "Silver Surfer (2003) #5", "description": "COMMUNION PART 5 The truth that drives the Surfer's actions comes to light, as does the horrifying fate that awaits all mankind!"}, {"titre": "Silver Surfer (2003) #4", "description": "COMMUNION PART 4 Armageddon is coming...is the Silver Surfer constructing the means of mankind's survival, or the weapon of its ultimate destruction?"}, {"titre": "Silver Surfer (2003) #3", "description": "COMMUNION PART 3 Denise Waters delves further into the mystery of her missing daughter as the Surfer's plan begins to take form!"}, {"titre": "Silver Surfer (2003) #2", "description": "COMMUNION PART 2 Ellie struggles to reunite with her mother, as Denise's search for her daughter takes a frightening turn."}, {"titre": "Silver Surfer (2003) #1", "description": "COMMUNION PART 1 Children all around the world are vanishing, spirited away by a gleaming figure from the stars! Are these just routine cases of alien abduction, or the harbinger of something far more sinister?"}, {"titre": "Marvel Universe: The End (2003) #4", "description": "The most powerful beings in the universe must decide how to deal with the nigh-omnipotent Thanos."}, {"titre": "Marvel Universe: The End (2003) #3", "description": "Thanos's power is escalating to Celestial-level heights. Will he be corrupted further by his new might?"}, {"titre": "Marvel Universe: The End (2003) #2", "description": "With almost all of the world's heroes dead, it's up to Thanos of Titan to save the world."}, {"titre": "Universe X (2000) #12", "description": "The Silver Surfer is joined by the Iron Avengers, the Sentinels, and Magneto, to battle the Absorbing Man! Meanwhile, Peter Parker, Venom, and the New York heroes do what they can to stave off the end of the world"}, {"titre": "Universe X (2000) #11", "description": "Mephisto's grand plan stands revealed! Find out how and why he has been manipulating the minds of Thanos, Nighthawk, Gargoyle and Dr. Doom.\n"}, {"titre": "Universe X (2000) #10", "description": "Creel is whole! Now, the monster that destroyed the Avengers is back with a vengeance! Meanwhile, in the land of the dead, the heroes have made their way to Death, Thanos, and Mephisto.\n"}, {"titre": "Universe X (2000) #7", "description": "Immortus' mutant battalion has arrived at Castle Doom! Can Reed Richards hold the horde off? Meanwhile, Thor, Captain Marvel, the Hulk, and the X-Men confront the Supreme Intelligence.\n"}, {"titre": "Universe X (2000)", "description": "Reed Richards thought that Galactus was defeated. He thought the Celestials were gone. He was wrong. Now, the heroes of the Marvel Universe await an unspeakable evil to befall them all. And it starts with the rebirth of Captain Mar-Vell.\n"}, {"titre": "Earth X (1999) #12", "description": "The new Galactus has arrived...to save Earth X?"}, {"titre": "Earth X (1999) #11", "description": "Black Bolt has failed to prevent Earth X's destruction...or has he?  Who is the final hope for the doomed planet?"}, {"titre": "Galactus the Devourer (1999) #6", "description": "Virtually every heavyweight hero stars in this planet-shattering conclusion! The Avengers, the Starjammers, the Imperial Guard, the Fantastic Four and the Silver Surfer make their last stand to save the Shi'ar homeworld! If they succeed in destroying Galactus, the universe will be saved...or will it?!"}, {"titre": "Galactus the Devourer (1999) #5", "description": "The epic cosmic adventure continues with guest stars The Kree, The Shi'ar, The Imperial Guard, The Starjammers, The Fantastic Four and The Avengers! The entire universe trembles before the might of Galactus, a god gone mad! In order to save Earth, a reluctant Silver Surfer has once again become the herald of Galactus! And to make matters worse, the Surfer is leading him directly to the Shi'ar homeworld!"}, {"titre": "Galactus the Devourer (1999) #4", "description": "Silver Surfer: once again the herald of Galactus?! In the aftermath of last issue's bombastic battle with the planet eater, the Earth's heroes witness the rebirth of one of the Devourer's former heralds...the Silver Surfer?! And things go from bad to worse as the Surfer leads the hungry Galactus straight for the homeworld inhabited by his former love, Mantis!"}, {"titre": "Galactus the Devourer (1999) #3", "description": "Galactus is prepared to consume the Earth, and even the power of the Avengers, the Fantastic Four and more may not be enough to stop him! You'll never believe the shocking ending, or the new beginning it unleashes!"}, {"titre": "Galactus the Devourer (1999) #2", "description": "The Devourer of Worlds has gone mad, and Earth's on his menu! The Silver Surfer and Alicia Masters rocket into space to stop Galactus, only to be attacked by the planet eater's latest and deadliest herald: Red Shift! And even if they can defeat him, will they return in time to save our world from becoming a smoking husk?!"}, {"titre": "Galactus the Devourer (1999) #1", "description": "Reunited with his paramour, everything is going fine for the Silver Surfer, until the new herald known as Red Shift arrives! The warning has arrived and all must fear his dark arrival! Galactus, the Devourer Of Worlds, is headed towards Earth... and we're on his menu! This intense exploration of the dreaded destroyer of planets blows the lid off the major cosmic questions of the Marvel Universe, such as: What is the secret reason for the existence of Galactus (that was hinted at in FANTASTIC FOUR #262)? Why did Galactus choose a Herald? More specifically, why did he choose Norrin Radd and change him into the Silver Surfer? Why was it vital that the Surfer defied and broke away from his master? Why has everything that has ever happened to the Surfer led to this adventure? And what is the Surfer's ultimate purpose?"}, {"titre": "Webspinners: Tales of Spider-Man (1999) #6", "description": "With the Silver Surfer now on Spider-Man's side (for now), they must band together not only to defeat Psycho-Man in the realm of Sub-Atomica, but also the powerful supervillain Annihilus!"}, {"titre": "Webspinners: Tales of Spider-Man (1999) #5", "description": "Can Spider-Man alone challenge an extremely motivated Silver Surfer? As if that wasn't enough, Spidey faces another daunting enemy, the ever powerful Psycho-Man."}, {"titre": "Webspinners: Tales of Spider-Man (1999) #4", "description": "We discover why the Silver Surfer was ready and able to pick a fight against humankind, but it didn't end up happening. Can Spider-Man stop the Surfer's crazy streak?"}, {"titre": "Silver Surfer (1987) #138", "description": "The ‘Cosmic Messiah’ has an agenda all its own, one that involves converting life on Earth into energy. The Thing guest-stars!\n"}, {"titre": "Silver Surfer (1987) #137", "description": "Return from the grave! With the aid of occult magic, Surfer is back in the Land of the Living! But does that mean Mephisto is close behind?\n"}, {"titre": "Silver Surfer (1987) #136", "description": "Mephisto is dead. The Silver Surfer is dead. On this journey to the underworld, there is no hope. But back on Earth, Scrier, Agatha Harkness and Alicia Masters attempt to reanimate the Surfer.\n"}, {"titre": "Silver Surfer (1987) #135", "description": "Scrier, a cosmic being who’s ‘the architect of the Earth’, is the only one that can save Surfer from a soul-ravaging virus."}, {"titre": "Silver Surfer (1987) #134", "description": "Henrietta Rose is a victim of The Other! Silver Surfer swoops in for a rescue, and unlocks a formative memory from his earliest days on Earth!\n"}, {"titre": "Silver Surfer (1987) #133", "description": "The Puppet Master relives all his past wrongs, leading to a change of heart when he finally meets Mephisto.\n"}, {"titre": "Fantastic Four (1996) #12", "description": "It's The Fantastic Four versus Terrax, Firelord, and Plasma! And if that wasn't enough, Doctor Doom is waiting in the wings!\n"}, {"titre": "Silver Surfer (1987) #132", "description": "The Gangers finally reveal their masterstroke to the Puppet Master, which involves their worship of the Silver Surfer. Spider-Man shows up with some bad news for Alicia regarding her stepfather.\n"}, {"titre": "Silver Surfer (1987) #131", "description": "Galactus continues to withhold information on The Other, the being responsible for Zenn-La’s demise. Before returning to the present, Norrin gets one final moment with his beloved Shalla-Bal.\n"}, {"titre": "Fantastic Four (1996) #11", "description": "During a quiet afternoon in Central Park, The Fantastic Four are attacked by none other than Terrax! Plus, a new member is added to Marvel's Finest Family.\n"}, {"titre": "Silver Surfer (1987) #130", "description": "This issue reveals the mystery of Zenn-La’s destruction. What being is powerful enough to knock out Galactus? In 1947 New York, Alicia gives her father a dire warning of his future…\n"}, {"titre": "Silver Surfer (1987) #-1", "description": "Stan “The Man” Lee narrates a ‘hidden’ Silver Surfer story featuring Galactus and a terrifying alien abduction!\n"}, {"titre": "Silver Surfer (1987) #129", "description": "The aftermath of the Clay Surfer’s attack transports Surfer and Alicia to 1947! Surfer has his emotions back, but will that help him return to the present?\n"}, {"titre": "Silver Surfer (1987) #128", "description": "Silver Surfer’s Puppet Master doppelganger is on the loose! Spider-Man and Daredevil guest-star to put the kibosh on the Clay Surfer…but the damage to New York City is done! Plus, the original Surfer reverts back to Norrin Radd!\n"}, {"titre": "Fantastic Four (1996) #7", "description": "Ben Grimm may be recuperating in the hospital, but The Fantastic Four are still on the job! Next stop: The Negative Zone! Featuring The X-Men!\n"}, {"titre": "Silver Surfer (1987) #127", "description": "Silver Surfer gives Alicia Masters a new way to ‘see’ the world. Seeking a cure for his amnesia and emotional roadblock, Surfer enlists the aid of the Puppet Master to create a new Silver Surfer ‘copy’ with all the memories of its original.\n"}, {"titre": "Fantastic Four (1996) #6", "description": "While Alicia Masters waits for Ben Grimm to show up for their date, The Fantastic Four battles The Super-Skrull! Featuring, The Silver Sufer!"}, {"titre": "Silver Surfer (1987) #126", "description": "It’s an OG Defenders reunion when Doctor Strange shows up! The Sorcerer Supreme enters the Surfer’s psyche to unblock an emotional barrier stemming from Norrin Radd. But what is Galactus doing in the farthest corners of Norrin’s mind?\n"}, {"titre": "Fantastic Four (1996) #5", "description": "Doctor Doom has captured Ben, Sue, and Black Panther! Can Ben and Johnny rescue their teammates? And just who is Wyatt Wingfoot?\n"}, {"titre": "Silver Surfer (1987) #125", "description": "Silver Surfer attempts to recover memories from his old friend and fellow Defender, the Hulk. But the jade giant is on a not-so-jolly rampage and Surfer needs to figure out why!\n"}, {"titre": "Silver Surfer (1987) #124", "description": "New Atlantis may unearth several memories for Silver Surfer, however its ruler is now dead. What is Atlantis without Namor? And can the Surfer recover his full, former self?\n"}, {"titre": "Silver Surfer Annual (1997) #1", "description": "The god-like Scrier makes their first appearance! This vastly powerful being has leveled a deal with the Silver Surfer, one that will challenge the Power Cosmic to its core!\n"}, {"titre": "X-Men Unlimited (1993) #13", "description": "The Silver Surfer guest-stars! Cyclops and his team are caught in a cosmic calamity that leaves them fugitives...in space!"}, {"titre": "Silver Surfer (1987) #123", "description": "Robbed of his emotions, Surfer returns to a post-Onslaught Earth in the hopes that Alicia Masters can reawaken his feelings. But when confronted with death, the Surfer remains unmoved. Plus, a mysterious being is trailing his every move…\n"}, {"titre": "Spider-Man Team-Up (1995) #2", "description": "A team-up of cosmic proportions! Spider-Man has fallen victim to the plot of the Mad Thinker, and his mind is under the madman's control! Only one person can save him: the rider of the space ways, Silver Surfer!\n"}, {"titre": "Guardians of the Galaxy (1990) #59", "description": "After Galactus goes missing, Starhawk makes it his mission to find out his whereabouts."}, {"titre": "Secret Defenders (1993) #14", "description": "Silver Surfer and Legacy must pacify the monks of the Oracle’s monastery. Will Thanos ever return what is not rightfully his? No chance! The battle for all-encompassing knowledge just got heated."}, {"titre": "Warlock Chronicles (1993) #8", "description": "Will Thor's mind be restored with the help of...Thanos?!"}, {"titre": "Warlock Chronicles (1993) #7", "description": "The Infinity Watch arrives in Asgard with a dire warning for Odin about his son."}, {"titre": "Silver Surfer (1987) #88", "description": "Thor’s coming for Thanos...! But Silver Surfer and the Mind Valkyrie know how outmatched the Thunder God might be, so they rush to Thanos’ ship before any serious harm is done!"}, {"titre": "Warlock and the Infinity Watch (1992) #23", "description": "Warlock and Pip save Silver Surfer from Thor, and must continue to subdue the insane god after the attack!"}, {"titre": "Warlock Chronicles (1993) #6", "description": "Moondragon and Adam try to cure Maxam of his amnesia...unsuccessfully."}, {"titre": "Silver Surfer (1987) #87", "description": "Adam Warlock and Silver Surfer enlist the help of Doctor Strange to take down the mad Thor."}, {"titre": "Silver Surfer (1987) #86", "description": "Silver Surfer must break up a brawl between an entirely insane Thor and Beta Ray Bill!"}, {"titre": "Marvel Super Heroes (1990) #15", "description": "Volstagg has always been one of Thor's closest friends but what happens when he has a \"mostly\" great adventure of his own? (Note: this issue contains only the Volstagg story)"}, {"titre": "Infinity Crusade (1993) #4", "description": "Earth's gathered champions are rocketing toward Paradise Omega, home of Adam Warlock's virtuous female doppleganger, the Goddess. Has she been slain? What is next for the heroes?"}, {"titre": "Doctor Strange, Sorcerer Supreme (1988) #55", "description": "Infinity Crusade crossover! Dormammu tries to persuade Doctor Strange to be his channel into another dimension, because the Dread One is so afraid of The Goddess!"}, {"titre": "Silver Surfer/Warlock: Resurrection (1993) #4", "description": "Adam Warlock vs. Mephisto in a battle of cosmic illusions! Silver Surfer and the Infinity Watch can only observe the showdown for the soul of Shalla-Bal. Mephisto proves a sore loser. Norrin and Shalla-Bal are reunited once more- but for how long?"}, {"titre": "What If? (1989) #49", "description": "In this thrilling What If? tale, we explore what would come to pass if Silver Surfer wielded the Infinity Gauntlet instead of Thanos!"}, {"titre": "Silver Surfer/Warlock: Resurrection (1993) #3", "description": "Silver Surfer and the Infinity Watch enter the hellish realm of Mephisto! In order to recover Shalla-Bal’s soul, Surfer gives Mephisto an ultimatum- his soul in exchange for his lover’s. Is this a Faustian deal too good to refuse? Adam Warlock holds the upper hand when he claims to have the Soul Gem."}, {"titre": "Silver Surfer/Warlock: Resurrection (1993) #2", "description": "Adam Warlock and his Infinity Watch have sworn to recover Shalla-Bal. But the crew’s not off to a great start! After opening a dimensional portal chock full of demons, Surfer and company find themselves in the thrall of cosmic battle. Which portal will lead to Shalla-Bal’s dimension? And even if her body is found, will her soul still be intact?"}, {"titre": "Silver Surfer/Warlock: Resurrection (1993) #1", "description": "The Resurrection begins! Although he lost part of himself when he became the Silver Surfer, Norrin Radd can never forget the woman he loved from his days on Zenn-La. With Shalla-Bal’s death never far from his thoughts, the Surfer is more haunted than ever. But when Pip the Troll delivers a message from Adam Warlock, Surfer’s hope sparks anew. Warlock claims Shalla-Bal is alive! But if so, where is she?"}, {"titre": "Doctor Strange, Sorcerer Supreme (1988) #50", "description": "In order to combat Dormammu in the Dark Dimension, Strange calls upon a new group of Secret Defenders for support."}, {"titre": "Doctor Strange, Sorcerer Supreme (1988) #45", "description": "After Galactus’ ship is destroyed, Death takes Doctor Strange on a tour of his family member’s deaths."}, {"titre": "Doctor Strange, Sorcerer Supreme (1988) #44", "description": "Cyttorak captures Doctor Strange and Nova as his High Priest and Priestess on his journey to the source of Eternity’s defeat. Strange calls upon Juggernaut."}, {"titre": "Doctor Strange, Sorcerer Supreme (1988) #43", "description": "Galactus seizes his precious Eye from Doc. Agamotto is enraged by Galactus’ actions and fights him."}, {"titre": "Silver Surfer (1987) #67", "description": "When Silver Surfer visits Titan, home world of Thanos, he learns the whereabouts of Galactus thanks to the Mentor. Surfer goes back to Earth, confronts Galactus, and learns Doctor Strange is trapped in a trance!"}, {"titre": "Silver Surfer (1987) #66", "description": "Now that the Silver Surfer has destroyed the Death Shrine, he has won the love of Princess Alaisa. The Princess is determined to show the Surfer that she is more than a mere mortal."}, {"titre": "Guardians of the Galaxy (1990) #25", "description": "Silver Surfer recruits the Guardians to eliminate…Galactus! It’s the team’s most challenging battle yet, as the Guardians duke it out for the fate of future life. Will the all-powerful Surfer be the savior of alienkind?"}, {"titre": "Doctor Strange, Sorcerer Supreme (1988) #42", "description": "Galactus needs Doctor Strange’s help to uncover a mystery about Eternity’s strange behavior."}, {"titre": "Silver Surfer (1987) #65", "description": "Thanos built a Death Shrine and the Silver Surfer is on his way to destroy it. However, when the Surfer meets Reptyl Prime, a battle begins!"}, {"titre": "Doctor Strange, Sorcerer Supreme (1988) #41", "description": "As the Undying Ones overcome Wolverine, he is compelled to fight Doctor Strange and Clea. Then, Doc and Wolverine travel through a Sa’arpool to destroy the Undying Ones!"}, {"titre": "Guardians of the Galaxy (1990) #24", "description": "Norrin Radd makes a startling entrance to deliver very bad news. How different is this Silver Surfer of the far future? Who or what is The Keeper?"}, {"titre": "Silver Surfer (1987) #64", "description": "When the Silver Surfer fights his alter ego \"dark side\", he realizes that there is no way to defeat him because they are two pieces of the same person. He then discovers a way to bind them together and get his powers back!"}, {"titre": "Silver Surfer (1987) #63", "description": "The Silver Surfer is infected with a virus that strips him of all his powers! But it's only when the Surfer comes face to face with his dark side that he may be forced into battle."}, {"titre": "Silver Surfer (1987) #62", "description": "The Silver Surfer is brought head on with the Collection Agency... But they are no match for the infamous Surfer."}, {"titre": "Doctor Strange, Sorcerer Supreme (1988) #37", "description": "The Silver Surfer swoops in viciously to blindside Doctor Strange! The question is…WHY?\n"}, {"titre": "Silver Surfer (1987) #61", "description": "The Silver Surfer is brought to the the Collector...and the whole Universe hangs in the balance!"}, {"titre": "Silver Surfer (1987) #60", "description": "The return of the Midnight Sun! Plus some surprising guest stars make an appearance!"}, {"titre": "Infinity Gauntlet (1991) #6", "description": "Nebula has the Infinity Gauntlet -- and, in the most shocking twist yet,\nThanos now stands with Earth's heroes to defeat her! Can one being\npossibly contain all that power? And if not Thanos, then who? With a\nshock ending that'll leave you begging for more!"}, {"titre": "Silver Surfer (1987) #59", "description": "SILVER SURFER VS. THANOS! Doctor Strange convinces the Surfer to engage in a duel of combat with Thanos in order to crush Nebula's ascension."}, {"titre": "Silver Surfer (1987) #58", "description": "In order to return to his present reality, Silver Surfer must come to terms with his past and forgive himself."}, {"titre": "New Warriors (1990) #17", "description": "Guest-starring Silver Surfer, former herald to Galactus! When the combined might of the New Warriors and the Fantastic Four proves insufficient, the heroes call on their cosmic ally to take down Terrax!"}, {"titre": "Silver Surfer (1987) #57", "description": "REAL LIFE OR FANTASY? Surfer is banished to an alternate dimension where he is forced to face his darkest fears and failures."}, {"titre": "Silver Surfer (1987) #56", "description": "The Silver Surfer's stripped of his Power Cosmic and is forced to kill himself…in an alternate reality!"}, {"titre": "Silver Surfer (1987) #55", "description": "Thanos creates the planet of Necronos and sacrifices millions to death!"}, {"titre": "Silver Surfer (1987) #54", "description": "ANIMALS ON THE LOOSE! Before his battle with Thanos, Silver Surfer must help Rhino who has realized that releasing Central Park Zoo's animals does more harm than good."}, {"titre": "Infinity Gauntlet (1991) #3", "description": "To start the day, Thanos wrote his name across the universe in planets.\nTo finish, he'll stand against the assembled might of Earth's remaining\nheroes! Plus: When Mistress Death rejects Thanos again, he creates his\nown perfect mate: Meet Terraxia the Terrible!"}, {"titre": "Damage Control (1991) #4", "description": "Cosmic co-stars! Silver Surfer becomes an ally to Damage Control in the wake of Galactus. Appearances by Lord Chaos and Master Order, the In-Betweener, and even…Death!"}, {"titre": "Silver Surfer (1987) #53", "description": "DEATH TO THE EMPEROR! With the help of Silver Surfer, the Kree agrees to a change-up in leadership."}, {"titre": "Doctor Strange, Sorcerer Supreme (1988) #32", "description": "Silver Dagger comes for what is rightfully his…something in the possession of none other than Doctor Strange!\n"}, {"titre": "Silver Surfer (1987) #52", "description": "WHILE A UNIVERSE TREMBLES! Drax has bigger problems to worry about than Firelord when Doctor Strange unites a group of heroes to prepare for a galactic battle with none other than...THANOS!"}, {"titre": "Doctor Strange, Sorcerer Supreme (1988) #31", "description": "Doctor Strange enters the dark depths of the Silver Surfer's mind! There he must restore the Surfer's inner psyche to a healthy state. After all, Strange needs him.\n"}, {"titre": "Silver Surfer (1987) #51", "description": "Nova must face her toughest enemy yet: her guilty conscience over being a herald to Galactus!"}, {"titre": "Infinity Gauntlet (1991) #1", "description": "Seeking to impress the Mistress Death, who returned him to life, Thanos\nhas gained control over the Infinity Gauntlet -- making him an\nall-powerful god! With Mephisto as his familiar, Thanos wipes out half\nof the life in the universe with a snap of his fingers! What will Earth\ndo when half its the heroes are killed?"}, {"titre": "Guardians of the Galaxy Annual (1991) #1", "description": "If the Guardians cannot prevent the creation of Korvac, their universe will end!"}, {"titre": "Silver Surfer Annual (1988) #4", "description": "The Surfer--with the power of the Quantum Bands-battles the Guardians of the Galaxy. Plus, Galactus retells the story of Silver Surfer's creation."}, {"titre": "Silver Surfer (1987) #50", "description": "Finally in possession of all the Infinity Stones, Thanos turns a stone golem into a powerful war machine."}, {"titre": "Silver Surfer (1987) #49", "description": "The Silver Surfer races back to Earth to warn the other heroes of Thanos' diabolical master plan."}, {"titre": "Silver Surfer (1987) #48", "description": "The Silver Surfer must answer for sins from his past!"}, {"titre": "Silver Surfer (1987) #47", "description": "Adam Warlock tries to stop Drax the Destroyer from living up to his name and putting an end to Soul World, while the Surfer receives a distressing warning from Mephisto."}, {"titre": "Silver Surfer (1987) #46", "description": "Drax and the Surfer wake up in the strange, alien Soul World after taking a beating from Thanos."}, {"titre": "Silver Surfer (1987) #45", "description": "Drax and the Surfer have enough power between them to annihilate small planets, but can they match the awesome force of Thanos when he wields all of the Infinity Stones?"}, {"titre": "Silver Surfer (1987) #44", "description": "Drax the Destroyer and the Silver Surfer partner up to defeat Thanos -- for real this time."}, {"titre": "Doctor Strange, Sorcerer Supreme (1988) #23", "description": "Strange's only hope lies in UMAR, Dormammu's twin sister! Can he get his mystical power back to thwart the dread Dormammu? And, what is Baron Mordo planning in the shadows?\n"}, {"titre": "Silver Surfer (1987) #43", "description": "The strange saga of the Silver Surfer in Dynamo City continues as he finds himself at the mercy of…lawyers?"}, {"titre": "Silver Surfer (1987) #42", "description": "The Surfer is forced to extend his stay in Dynamo City -- plus, Drax the Destroyer shares some distressing news."}, {"titre": "Silver Surfer (1987) #41", "description": "A former Herald of Galactus heads to Dynamo City in search of employment."}, {"titre": "Silver Surfer (1987) #40", "description": "The Surfer takes a trip to the ever-dangerous Dynamo City to attend the execution of Thanos' last will and testament."}, {"titre": "Daredevil (1964) #282", "description": "The final battle with Mephisto is at hand! But can even the mighty Power Cosmic of the Silver Surfer stand up to the Prince of Lies -- in his own domain?"}, {"titre": "Silver Surfer (1987) #39", "description": "The Silver Surfer finds himself pitted against the formidable Algol Demonstar in an arena duel for a huge alien audience."}, {"titre": "Daredevil (1964) #281", "description": "Daredevil continues his endeavor to escape Hell, and all hope seems lost. But his plight is seen by a voyager of the stars - THE SILVER SURFER!"}, {"titre": "Marvel Fanfare (1982) #51", "description": "Silver Surfer and Mantis combine forces in “The Great Terror”, an alternate universe tale! The Kree Intelligencia is after Mantis’ human/plant hybrid son, Sprout! Digital issue omits \"The Believer\" story."}, {"titre": "Silver Surfer Annual (1988) #3", "description": "The Surfer tries to take his revenge on Garnok, but will it alleviate his guilt over the people he failed to save from Galactus?"}, {"titre": "Silver Surfer: Enslavers (1990) #1", "description": "After the Surfer departs Earth for his home world, the heroes of Earth along with all its inhabitants are captured by the Enslavers. The Surfer must face the Enslavers' leader to save the people of Zenn-La, Earth and countless other planets."}, {"titre": "Silver Surfer (1987) #33", "description": "Silver Surfer may reconsider being a pacifist after going head-to-head with frequent Fantastic Four pest the Impossible Man!"}, {"titre": "Doctor Strange, Sorcerer Supreme (1988) #9", "description": "The Man, The Myth, The Magic! A special editorial on Doctor Stephen Strange, as told by Morgana Blessing."}, {"titre": "Silver Surfer (1987) #25", "description": "Silver Surfer is tricked into becoming an ally of the Skrulls in their battle against the Badoons and Kree. "}, {"titre": "Doctor Strange, Sorcerer Supreme (1988) #1", "description": "Doctor Strange is dead! Or so the world believes, as the work of a Sorcerer Supreme is never done! Strange’s newest task is also his most dire: defeat the dread DORMAMMU!"}, {"titre": "Silver Surfer (1987) #14", "description": "Silver Surfer vs. Silver Surfer? One’s an imposter, one’s the real deal. And by the end of this issue, only one will stand triumphant!"}, {"titre": "Silver Surfer (1987) #13", "description": "Ronan the Accuser comes to Nenora’s aid after a band of soldiers attempt mutiny. How much longer can the Skrull imposter maintain her ruse? Surfer finds a moment to mourn the death of Mantis, but is invigorated by a new mission- finding her son!"}, {"titre": "Silver Surfer (1987) #12", "description": "Cap'n Reptyl stands triumphant over Surfer and Nova…but the battle’s not lost yet! Nenora’s Skrull identify is uncovered, but by who? The Contemplator meets a ruthless end."}, {"titre": "Silver Surfer (1987) #11", "description": "Silver Surfer and Nova team-up! Will these two cosmic wanderers ever find The Contemplator? Nenora has usurped control over the Kree following the Supreme Intelligence’s meltdown. Plus, attack of the space pirates!"}, {"titre": "Silver Surfer (1987) #10", "description": "The Elders pay for their insurrection, and Galactus feasts. On Kree-Lar, infighting between Skrulls establishes the leadership of an entire alien race. Death comes for Galactus. Is it coming for all of Zenn-La too?"}, {"titre": "Silver Surfer (1987) #9", "description": "The Elders of the Universe need all the Infinity Gems for their takedown of Galactus- too bad the Soul Gem is safe in Surfer’s possession! Will Norrin relinquish the Soul Gem for the freedom of Shalla Bal and Mantis? Nova guest-stars!"}, {"titre": "Silver Surfer (1987) #8", "description": "Absorbed into the hive mind of the Supreme Intelligence, Silver Surfer sees a reality never destined to be. Love, companionship, the blissfulness of peace- will Norrin Radd ever experience these things again? Back on Zenn-La, Shalla Bal’s in dire straits…and Mantis is nowhere to be found!"}, {"titre": "Silver Surfer (1987) #7", "description": "Kree forces invade the peaceful planet of Zenn-La. Can Surfer, Mantis and Shalla Bal prevent the coming onslaught? Surfer must reconcile his feelings for Mantis, all while striking an agreement with the Kree’s Supreme Intelligence!"}, {"titre": "Silver Surfer Annual (1988) #1", "description": "It’s Silver Surfer Vs. the ever-shifting Super Skrull in this Evolutionary Wars crossover issue!"}, {"titre": "Silver Surfer (1987) #6", "description": "As the Kree/Skrull war rages on, Silver Surfer and Mantis uncover the Elders’ plot against Galactus. A defeated Obliterator says far too much. And when Norrin’s home world of Zenn-La is threatened with imminent war, Silver Surfer must answer the call!"}, {"titre": "Silver Surfer (1987) #5", "description": "Out of the frying pan…and into a new galactic battle! Mantis and Surfer may have escaped the Elders of the Universe, but how will they fare against The Obliterator? Spurred by the threat of death, Surfer displays the incredible Power Cosmic!"}, {"titre": "Silver Surfer (1987) #4", "description": "Mantis’ mysterious (and complex) origin revealed! Revived from the brink of death by the former Avenger, Silver Surfer agrees to help Mantis in her battle against the Elders. Surfer and Mantis vs. Ego the Living Planet!"}, {"titre": "Silver Surfer (1987) #3", "description": "Surfer hunts down The Collector seeking answers about his involvement in the Contest of Champions. What plans do the Elders of the Universe have for Galactus? Plus, the return of Espirita!"}, {"titre": "Silver Surfer (1987) #2", "description": "Free to travel the cosmos, Surfer makes a triumphant return to Zenn-La. Once there, Norrin discovers that former love Shalla Bal is the newly minted ruler, and has restored the planet to its former glory! But is the romantic reunion too good to be true? Shalla Bal’s priorities have shifted, and Silver Surfer is a shadow of his former self."}, {"titre": "Silver Surfer (1987) #1", "description": "Silver Surfer rises in his own ongoing! Bound to Earth, Surfer makes the most of his situation. Will the being who once was Norrin Radd understand humanness once more? Surfer agrees to some unsavory terms with Galactus -- all to reclaim his freedom!"}, {"titre": "Defenders (1972) #125", "description": "Out with the old. Meet the BRAND NEW Defenders!"}, {"titre": "Defenders (1972) #114", "description": "Null the Living Darkness seeks to evolve into a higher form, and who better to join forces with than the despicable Overmind?"}, {"titre": "Silver Surfer (1982) #1", "description": "The galactic herald returns in this jam-packed one-shot! Silver Surfer recalls happier times with the Fantastic Four. With Norrin Radd becoming a distant memory with each passing day, will Surfer ever recover the man he once was? Surfer returns to his homeland Zenn-La to find absolute devastation. A new quest begins for Silver Surfer -- one that involves finding his soulmate, Shalla Bal!"}, {"titre": "Uncanny X-Men (1963) #135", "description": "DARK PHOENIX! Jean Grey has become the Dark Phoenix, a corruption of the cosmic entity bonded to Jean. Now the Dark Phoenix seeks to destroy everything in its path! What can the X-Men do to defeat it? Must they kill Jean Grey?"}, {"titre": "Marvel Presents (1975) #8", "description": "Silver Surfer pits his power cosmic against the Guardians of the Galaxy's greatest foes--the Badoon!"}]}